{
  "architecture": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            784
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            784
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      784
    ]
  },
  "weights": [
    [
      [
        [
          -0.040816761553287506,
          0.05335178226232529,
          -0.0012550652027130127,
          0.010504931211471558,
          0.07108000665903091,
          0.013609051704406738,
          0.07055402547121048,
          -0.030638061463832855,
          -0.03465104103088379,
          -0.04662472754716873,
          -0.022250592708587646,
          0.04346860200166702,
          0.023556523025035858,
          -0.04488946497440338,
          -0.058037638664245605,
          -0.07282114028930664,
          0.04321619123220444,
          -0.0035133734345436096,
          -0.02556370198726654,
          -0.021205797791481018,
          -0.04126669093966484,
          0.05144009739160538,
          -0.038335684686899185,
          0.04221377521753311,
          0.03324155509471893,
          -0.0012401267886161804,
          -0.004296354949474335,
          0.024393469095230103,
          -0.03067837283015251,
          0.08135242015123367,
          0.017193160951137543,
          0.03632751852273941,
          -0.08304791152477264,
          -0.08174839615821838,
          0.025296494364738464,
          0.0006477087736129761,
          0.009883932769298553,
          -0.07947398722171783,
          -0.04725974053144455,
          -0.07790426164865494,
          -0.03892780467867851,
          -0.004618190228939056,
          0.039065077900886536,
          0.010181427001953125,
          -0.08119552582502365,
          0.013534024357795715,
          -0.07000187784433365,
          -0.07591697573661804,
          0.06933645159006119,
          -0.051726602017879486,
          -0.03319482505321503,
          0.013958282768726349,
          -0.03441204875707626,
          0.003907449543476105,
          -0.008793115615844727,
          -0.055604130029678345,
          0.017276309430599213,
          -0.06964606046676636,
          -0.05032023787498474,
          0.013437420129776001,
          0.05625533312559128,
          0.030183300375938416,
          0.03888320177793503,
          0.04270701855421066
        ],
        [
          0.055128954350948334,
          -0.0247788168489933,
          0.06722966581583023,
          -0.0826684907078743,
          -0.016681522130966187,
          0.003952093422412872,
          0.035334549844264984,
          0.07561025768518448,
          0.05932960659265518,
          0.03424841910600662,
          -0.03732619062066078,
          -0.020092561841011047,
          0.04308506101369858,
          0.08164455741643906,
          0.04703503102064133,
          0.0022769421339035034,
          -0.02352621778845787,
          0.0464269295334816,
          0.006252117455005646,
          0.064434714615345,
          -0.036370158195495605,
          -0.0457271933555603,
          -0.0223405584692955,
          0.0562790110707283,
          0.007870733737945557,
          0.033548690378665924,
          0.027841664850711823,
          0.06419714540243149,
          -0.015981771051883698,
          -0.06506254523992538,
          0.005002744495868683,
          0.016277380287647247,
          -0.015654273331165314,
          0.032226622104644775,
          -0.07346878945827484,
          -0.023174576461315155,
          -0.056229740381240845,
          -0.06570379436016083,
          -0.009357213973999023,
          -0.08057202398777008,
          -0.05338878184556961,
          0.007112428545951843,
          0.03926981985569,
          0.0589873269200325,
          -0.046550605446100235,
          0.019475556910037994,
          -0.07004359364509583,
          -0.04198360815644264,
          -0.020976074039936066,
          -0.035202547907829285,
          0.025376468896865845,
          -0.046074382960796356,
          -0.0654476135969162,
          -0.026879113167524338,
          -0.05994933843612671,
          0.052684418857097626,
          -0.00017254799604415894,
          0.003648988902568817,
          0.038319699466228485,
          0.03233722597360611,
          -0.05123387649655342,
          -0.005024425685405731,
          0.07563868910074234,
          -0.017690137028694153
        ],
        [
          -0.07846729457378387,
          0.05170822888612747,
          0.0031797662377357483,
          -0.07280627638101578,
          -0.024045515805482864,
          0.07994375377893448,
          0.005242355167865753,
          -0.033297985792160034,
          0.0648125484585762,
          -0.027928519994020462,
          0.040191471576690674,
          0.0369204580783844,
          -0.027791466563940048,
          -0.03454376757144928,
          0.020943887531757355,
          0.011298015713691711,
          -0.02911337837576866,
          -0.06631701439619064,
          -0.006327681243419647,
          -0.053275249898433685,
          0.07071275264024734,
          0.011211320757865906,
          0.054313890635967255,
          0.010605387389659882,
          -0.028257180005311966,
          0.06556422263383865,
          -0.015659168362617493,
          0.03844644874334335,
          0.075302354991436,
          -0.06727087497711182,
          0.05105263739824295,
          0.03435136377811432,
          0.016580402851104736,
          -0.006207816302776337,
          -0.07207845151424408,
          0.061576150357723236,
          0.013024210929870605,
          -0.019879072904586792,
          -0.05302739143371582,
          -0.018494494259357452,
          -0.013661935925483704,
          0.04385105520486832,
          0.0151129812002182,
          -0.04419960081577301,
          0.08238730579614639,
          0.0793117806315422,
          -0.009328819811344147,
          0.07069573551416397,
          -0.02571052312850952,
          -0.04461640119552612,
          0.040181003510951996,
          -0.07904068380594254,
          0.037560850381851196,
          0.049549736082553864,
          0.02437800168991089,
          -0.07628224790096283,
          -0.016177885234355927,
          -0.03225966915488243,
          0.046867527067661285,
          -0.07740970700979233,
          -0.05465726554393768,
          -0.03832760453224182,
          0.027186274528503418,
          -0.03258626163005829
        ],
        [
          0.07172629982233047,
          -0.017609380185604095,
          -0.036809779703617096,
          0.0681847557425499,
          -0.023506224155426025,
          0.040324315428733826,
          0.024222761392593384,
          -0.07239475101232529,
          -0.0003479272127151489,
          0.05421631783246994,
          -0.07683613896369934,
          0.08313258737325668,
          0.03308923542499542,
          0.027927137911319733,
          -0.0659736916422844,
          0.07694826275110245,
          9.93683934211731e-05,
          0.02376420795917511,
          -0.037674881517887115,
          -0.08180063962936401,
          0.03343736380338669,
          0.06216327100992203,
          0.021728865802288055,
          -0.00020393729209899902,
          0.028665676712989807,
          0.028744451701641083,
          6.862729787826538e-05,
          0.03883346915245056,
          -0.06635834276676178,
          -0.05742727220058441,
          -0.015051491558551788,
          0.0729316994547844,
          0.016561254858970642,
          0.07114500552415848,
          -0.08240383118391037,
          0.061517857015132904,
          0.08348169177770615,
          -0.056136105209589005,
          -0.002328842878341675,
          -0.07555805146694183,
          0.004737697541713715,
          -0.008826285600662231,
          0.06255502253770828,
          0.030086494982242584,
          0.02244432270526886,
          0.04360236972570419,
          -0.022060532122850418,
          0.07242391258478165,
          -0.05086121708154678,
          -0.016839511692523956,
          -0.07402268052101135,
          -0.08376482874155045,
          0.018094658851623535,
          -0.08030830323696136,
          -0.03248624876141548,
          -0.0058037713170051575,
          0.05890432745218277,
          -0.032559629529714584,
          -0.05781906098127365,
          -0.02506415918469429,
          0.07072118669748306,
          -0.08070085942745209,
          0.03778032958507538,
          -0.07973365485668182
        ],
        [
          -0.07938935607671738,
          -0.004155248403549194,
          0.057604797184467316,
          0.019627369940280914,
          0.008081473410129547,
          -0.05823533982038498,
          -0.0392223484814167,
          0.040912218391895294,
          0.0036440566182136536,
          -0.002755366265773773,
          0.025121815502643585,
          -0.00537409633398056,
          0.01896682381629944,
          0.007711760699748993,
          0.06481697410345078,
          0.027987338602542877,
          0.002381466329097748,
          -0.0652158260345459,
          0.04990316182374954,
          -0.06773695349693298,
          0.0057825371623039246,
          0.07600253075361252,
          -0.0816812589764595,
          -0.001333080232143402,
          0.04091540724039078,
          0.08201966434717178,
          0.027937747538089752,
          -0.0513366162776947,
          0.07588047534227371,
          0.0004296153783798218,
          -0.038543716073036194,
          -0.05959033966064453,
          0.03615029901266098,
          -0.003838948905467987,
          0.04466130584478378,
          0.022434614598751068,
          -0.020545318722724915,
          -0.07382265478372574,
          -0.08273600041866302,
          -0.04578328877687454,
          0.045075200498104095,
          0.07249464839696884,
          -0.0729970782995224,
          0.020998932421207428,
          -0.05701127648353577,
          -0.061980485916137695,
          0.029011495411396027,
          -0.036337871104478836,
          -0.06986590474843979,
          -0.018035821616649628,
          -0.04944944009184837,
          -0.08364582061767578,
          0.06816748529672623,
          -0.02102656662464142,
          0.003225468099117279,
          -0.026066895574331284,
          0.013263627886772156,
          -0.005902297794818878,
          -0.024133294820785522,
          0.04837528616189957,
          -0.02358623966574669,
          -0.04706677421927452,
          -0.037934351712465286,
          0.03758163005113602
        ],
        [
          0.004903092980384827,
          0.0593426451086998,
          0.04639557749032974,
          0.0305047407746315,
          -0.03145471215248108,
          -0.05940398946404457,
          -0.03606025129556656,
          0.05649933964014053,
          0.059836216270923615,
          0.07061374932527542,
          -0.04253828525543213,
          0.01199255883693695,
          -0.023099392652511597,
          0.05183730274438858,
          0.00577700138092041,
          -0.03571591153740883,
          -0.04238590970635414,
          -0.03724619001150131,
          -0.0146847665309906,
          -0.03072686493396759,
          0.021723270416259766,
          -0.015880972146987915,
          0.06603033095598221,
          -0.029048960655927658,
          0.07300854474306107,
          0.054053522646427155,
          -0.06435535103082657,
          -0.004703424870967865,
          -0.04797278717160225,
          0.04980377107858658,
          -0.0641096830368042,
          -0.06593883782625198,
          0.0039247795939445496,
          -0.018851004540920258,
          0.006187081336975098,
          0.04916011542081833,
          -0.014769241213798523,
          0.06485366076231003,
          -0.026750121265649796,
          -0.026096496731042862,
          -0.0782691165804863,
          -0.02724706009030342,
          0.010579176247119904,
          0.06668629497289658,
          -0.0781913623213768,
          -0.024566136300563812,
          0.05116076022386551,
          -0.07900047302246094,
          0.04070562124252319,
          -0.01871064305305481,
          -0.035718679428100586,
          -0.07923176884651184,
          0.05977454036474228,
          0.0052968040108680725,
          0.032987020909786224,
          0.03168213367462158,
          -0.032828543335199356,
          0.029245436191558838,
          0.05851059406995773,
          -0.007512219250202179,
          -0.06687936931848526,
          0.02479502558708191,
          0.007165528833866119,
          0.048128314316272736
        ],
        [
          0.03129579871892929,
          0.01688040792942047,
          0.06605441123247147,
          0.013158336281776428,
          -0.05017492175102234,
          0.07391426712274551,
          -0.07700721174478531,
          -0.022111572325229645,
          -0.012212015688419342,
          0.03388524800539017,
          0.009208068251609802,
          0.03210735321044922,
          0.08328359574079514,
          -0.017692305147647858,
          0.08049068599939346,
          -0.051389180123806,
          0.03744325041770935,
          0.007263600826263428,
          0.02112387865781784,
          -0.04108463600277901,
          -0.06175751984119415,
          0.009488016366958618,
          -0.07261896133422852,
          0.03665252774953842,
          -0.025187715888023376,
          0.008975312113761902,
          0.07635260373353958,
          0.03978067636489868,
          -0.08276569843292236,
          -0.050197966396808624,
          0.06723348051309586,
          0.08232422918081284,
          -0.06780916452407837,
          -0.05018077790737152,
          0.005709372460842133,
          0.08019036799669266,
          0.061097852885723114,
          0.04827155917882919,
          -0.029556769877672195,
          -0.001164563000202179,
          0.04166945070028305,
          0.05799131840467453,
          0.046137936413288116,
          0.04030412435531616,
          0.07522255927324295,
          -0.047585830092430115,
          -0.05797380208969116,
          -0.03841771185398102,
          0.03924199938774109,
          -0.03110511600971222,
          0.03341618925333023,
          -0.051843199878931046,
          0.0830472931265831,
          0.08155230432748795,
          0.010469593107700348,
          -0.06848160177469254,
          -0.04658888652920723,
          -0.021433241665363312,
          0.06603624671697617,
          -0.011582277715206146,
          0.0009957030415534973,
          -0.0745249092578888,
          -0.007049031555652618,
          0.023130014538764954
        ],
        [
          -0.07599861919879913,
          -0.0008333995938301086,
          0.010552801191806793,
          -0.034580107778310776,
          -0.03016328439116478,
          0.07099328190088272,
          -0.0009263902902603149,
          0.052020929753780365,
          0.022274836897850037,
          -0.07047085464000702,
          -0.07917266339063644,
          -0.0639948919415474,
          0.013994604349136353,
          0.08201392740011215,
          0.04964409023523331,
          -0.015631355345249176,
          0.06961474567651749,
          -0.05064304172992706,
          0.054582707583904266,
          0.028834514319896698,
          0.06693363934755325,
          -0.05739083141088486,
          0.07840516418218613,
          0.04302570968866348,
          -0.026674795895814896,
          -0.008475229144096375,
          0.07989691942930222,
          0.02380317449569702,
          0.0221233069896698,
          -0.0029743239283561707,
          0.03274913132190704,
          -0.023372776806354523,
          -0.030247755348682404,
          -0.04937959089875221,
          -0.058251239359378815,
          0.06784529238939285,
          0.030863776803016663,
          -0.008477754890918732,
          0.0061289966106414795,
          0.06460607796907425,
          -0.05329383909702301,
          -0.06553379446268082,
          -0.07191668450832367,
          0.06571681052446365,
          0.003036811947822571,
          0.054045550525188446,
          -0.02243708074092865,
          -0.06756628304719925,
          -0.0022279247641563416,
          0.015320606529712677,
          0.06070644408464432,
          -0.018929243087768555,
          -0.03372970595955849,
          -0.0444381944835186,
          0.06449220329523087,
          0.0056578367948532104,
          -0.07904963195323944,
          -0.024303659796714783,
          0.06302068382501602,
          -0.01803327351808548,
          -0.08262493461370468,
          0.016989223659038544,
          0.01066809892654419,
          0.042417533695697784
        ],
        [
          -0.004126489162445068,
          -0.05169527605175972,
          0.06784195452928543,
          -0.07623016834259033,
          0.007452055811882019,
          -0.042557016015052795,
          -0.05046447366476059,
          -0.02519790455698967,
          -0.07772509008646011,
          -0.06842544674873352,
          -0.046893540769815445,
          -0.05411464348435402,
          0.011745885014533997,
          0.07587764412164688,
          -0.013183310627937317,
          -0.009576037526130676,
          0.015658147633075714,
          -0.052276361733675,
          -0.01916038990020752,
          0.025140970945358276,
          -0.035122670233249664,
          -0.02031540870666504,
          -0.027332231402397156,
          0.05682437866926193,
          -0.02035762369632721,
          -0.06359659880399704,
          -0.0069367289543151855,
          0.011168085038661957,
          0.030034035444259644,
          0.0709642842411995,
          -0.04866263270378113,
          0.04716021567583084,
          -0.06037022918462753,
          0.0032626688480377197,
          -0.00040569156408309937,
          0.021724596619606018,
          -0.04203992336988449,
          0.05044051259756088,
          -0.01221746951341629,
          -0.0008425042033195496,
          0.05967866629362106,
          -0.07464822381734848,
          0.040992237627506256,
          -0.014356009662151337,
          -0.02597905695438385,
          0.019575245678424835,
          -0.007099367678165436,
          0.06352240592241287,
          0.0312650129199028,
          0.025357075035572052,
          0.015543229877948761,
          -0.06578990817070007,
          -0.01445973664522171,
          -0.0769774466753006,
          0.050550855696201324,
          -0.013214051723480225,
          0.05635013431310654,
          0.0674978718161583,
          -0.005515865981578827,
          -0.0010739564895629883,
          -0.023917607963085175,
          -0.05330898240208626,
          -0.03866981714963913,
          -0.07400193810462952
        ],
        [
          -0.014515265822410583,
          -0.030546311289072037,
          -0.02666505053639412,
          0.06919711083173752,
          0.010300010442733765,
          0.05692095309495926,
          0.00017181038856506348,
          0.06452835351228714,
          0.05154041200876236,
          0.08394696563482285,
          0.04663645476102829,
          0.006814993917942047,
          -0.0766109898686409,
          0.03614223748445511,
          0.018379442393779755,
          -0.012361302971839905,
          -0.06490062177181244,
          -0.044958434998989105,
          0.0456637367606163,
          0.03546462208032608,
          -0.020914345979690552,
          0.07659117132425308,
          -0.008597403764724731,
          -0.06518074870109558,
          -0.0297379232943058,
          -0.014651075005531311,
          0.0015670210123062134,
          0.055007435381412506,
          0.04906097799539566,
          0.03811574727296829,
          0.05708795040845871,
          0.08260650187730789,
          0.05998700112104416,
          -0.07514777034521103,
          -0.0837448313832283,
          -0.08304470032453537,
          0.08303143829107285,
          0.0026968494057655334,
          -0.06965416669845581,
          0.06058067828416824,
          0.06057009845972061,
          0.06920693069696426,
          -0.06645005941390991,
          -0.06300390511751175,
          0.05975080281496048,
          0.03286348283290863,
          0.014977127313613892,
          -0.07923543453216553,
          0.0727364793419838,
          0.038928382098674774,
          0.005552604794502258,
          -0.05315229296684265,
          0.049348630011081696,
          0.03160558640956879,
          -0.05312523990869522,
          -0.021925605833530426,
          -0.08259216696023941,
          -0.06717166304588318,
          -0.0020516663789749146,
          -0.07867153733968735,
          -0.04471232369542122,
          0.00517900288105011,
          0.004429638385772705,
          -0.0331936813890934
        ],
        [
          -0.000975482165813446,
          0.03028327226638794,
          -0.0030139535665512085,
          -0.03230270743370056,
          0.03671780973672867,
          -0.001817263662815094,
          -0.049681875854730606,
          -0.03036080300807953,
          -0.04548124223947525,
          -0.07432392239570618,
          0.0467512384057045,
          0.08042243868112564,
          0.0508386567234993,
          -0.040675096213817596,
          -0.06550399214029312,
          -0.016116760671138763,
          0.08280610293149948,
          -0.04015517607331276,
          0.009123057126998901,
          -0.04347711056470871,
          -0.03657110780477524,
          0.07226712256669998,
          -0.0747566819190979,
          0.04206299036741257,
          -0.015053816139698029,
          -0.02220342308282852,
          0.06087743490934372,
          0.059908442199230194,
          0.061658985912799835,
          0.05036374181509018,
          0.03455660492181778,
          -0.039474114775657654,
          -0.0043085068464279175,
          0.07857457548379898,
          -0.028159070760011673,
          0.06648854166269302,
          -0.04126282036304474,
          0.015849769115447998,
          0.0830535814166069,
          0.048586465418338776,
          0.0737525001168251,
          -0.06956921517848969,
          0.031080231070518494,
          -0.02836170420050621,
          0.051195986568927765,
          0.03718867152929306,
          -0.02185545489192009,
          -0.05882953852415085,
          -0.0032256916165351868,
          -0.06260019540786743,
          -0.016232915222644806,
          -0.02992016077041626,
          -0.0821596011519432,
          -0.02582034468650818,
          -0.002773493528366089,
          -0.08083394169807434,
          -0.012062549591064453,
          0.004096068441867828,
          -0.02067980170249939,
          0.03373447805643082,
          0.06489352136850357,
          -0.07068024575710297,
          0.02096756547689438,
          0.011915847659111023
        ],
        [
          -0.04308309406042099,
          -0.006789125502109528,
          0.03533613681793213,
          0.026456981897354126,
          -0.06608256697654724,
          0.07361543923616409,
          -0.025292523205280304,
          -0.06816620379686356,
          -0.08179633319377899,
          -0.04291100427508354,
          0.03101363033056259,
          0.05872973054647446,
          -0.02436474710702896,
          0.0054217055439949036,
          -0.027490343898534775,
          0.03634779900312424,
          -0.07907698303461075,
          0.03181958943605423,
          -0.04131355881690979,
          0.0816214457154274,
          0.06346219033002853,
          0.05085074156522751,
          0.0788816437125206,
          -0.0007443353533744812,
          0.04627443104982376,
          -0.002601705491542816,
          0.04873659461736679,
          0.045483894646167755,
          0.03462480753660202,
          -0.03135971352458,
          0.020864568650722504,
          0.04375138133764267,
          -0.05863262340426445,
          0.05878431349992752,
          -0.03885674849152565,
          -0.08207711577415466,
          -0.04599606990814209,
          -0.0780603289604187,
          0.043979041278362274,
          -0.010069340467453003,
          -0.030364975333213806,
          -0.025140386074781418,
          0.04127364605665207,
          -0.07494806498289108,
          0.07709472626447678,
          0.012667134404182434,
          0.00018474459648132324,
          -0.07650656253099442,
          -0.03150356560945511,
          0.06167132407426834,
          0.04261869937181473,
          -0.06860363483428955,
          -0.008449055254459381,
          0.05567020922899246,
          0.04878155142068863,
          -0.026775892823934555,
          0.033569350838661194,
          0.06719314306974411,
          -0.07142756879329681,
          -0.051362305879592896,
          0.03582905977964401,
          -0.05413945019245148,
          -0.014908038079738617,
          -0.08078615367412567
        ],
        [
          0.062468357384204865,
          -0.03975145146250725,
          0.048389188945293427,
          0.056595735251903534,
          0.016504742205142975,
          -0.05650888383388519,
          0.038565292954444885,
          -0.05270351096987724,
          0.06421413272619247,
          0.018909849226474762,
          -0.05965034291148186,
          -0.04808024317026138,
          -0.004447869956493378,
          -0.018497124314308167,
          0.052154697477817535,
          0.03093092143535614,
          0.05322495847940445,
          -0.07489001005887985,
          -0.020495161414146423,
          0.015726998448371887,
          0.03188163787126541,
          0.00036945194005966187,
          0.011339329183101654,
          -0.03858992084860802,
          0.08174016326665878,
          -0.0014240890741348267,
          -0.02291741594672203,
          0.010630257427692413,
          0.01969122141599655,
          -0.02413289248943329,
          0.07087963074445724,
          -0.024114705622196198,
          -0.06600503623485565,
          0.020280510187149048,
          0.02194315195083618,
          0.045980729162693024,
          -0.05012324079871178,
          -0.040214378386735916,
          0.07864610105752945,
          0.049385689198970795,
          -0.0039001330733299255,
          -0.03733401000499725,
          -0.0072869062423706055,
          -0.04359631612896919,
          0.031008876860141754,
          -0.07828215509653091,
          -0.07742868363857269,
          -0.03692655637860298,
          -0.08351993560791016,
          -0.042645376175642014,
          0.08080794662237167,
          -0.03829258680343628,
          0.03574400395154953,
          -0.0745467096567154,
          0.045978955924510956,
          -0.00426039844751358,
          0.034518562257289886,
          0.0037275776267051697,
          0.01088031381368637,
          0.07985933870077133,
          -0.03503457084298134,
          -0.0688813328742981,
          0.024476774036884308,
          0.06074700504541397
        ],
        [
          -0.0471683107316494,
          -0.026911664754152298,
          0.07291657477617264,
          0.03828151524066925,
          0.07298732548952103,
          -0.021573543548583984,
          0.017363548278808594,
          -0.013119995594024658,
          0.015950024127960205,
          -0.001636788249015808,
          0.059459395706653595,
          0.013698495924472809,
          0.030228078365325928,
          -0.06131737679243088,
          0.0827159658074379,
          -0.059996869415044785,
          -0.05354422330856323,
          0.0670015886425972,
          -0.02493458241224289,
          -0.03932414576411247,
          -0.020574331283569336,
          -0.07833220809698105,
          -0.08182438462972641,
          0.004823677241802216,
          -0.022078420966863632,
          -0.06770169734954834,
          -0.028681017458438873,
          0.0002547726035118103,
          0.05320759862661362,
          -0.02462945133447647,
          0.004927575588226318,
          -0.02116534858942032,
          -0.02263776957988739,
          0.034133367240428925,
          -0.031685441732406616,
          0.026793964207172394,
          0.03021235764026642,
          -0.08144938200712204,
          -0.059913985431194305,
          -0.037752293050289154,
          -0.029512830078601837,
          -0.0043584853410720825,
          -0.040586452931165695,
          0.05986996740102768,
          -0.020978756248950958,
          0.007250361144542694,
          0.021642573177814484,
          0.00830281525850296,
          -0.07903583347797394,
          0.018821388483047485,
          -0.029476609081029892,
          0.0652686133980751,
          0.05577457696199417,
          -0.04941027611494064,
          0.035923220217227936,
          -0.02683274820446968,
          0.07295673340559006,
          -0.049782149493694305,
          0.055920131504535675,
          0.05912607163190842,
          -0.07192232459783554,
          0.08218810707330704,
          0.04488863795995712,
          -0.003323480486869812
        ],
        [
          0.025360889732837677,
          -0.0314612090587616,
          0.042643509805202484,
          -0.03890115022659302,
          0.011501654982566833,
          -0.02613680809736252,
          -0.07584258913993835,
          0.03204265981912613,
          0.024609960615634918,
          -0.05769592523574829,
          -0.05796532332897186,
          -0.02787357196211815,
          -0.05996239557862282,
          -0.034168001264333725,
          0.04351548105478287,
          0.00649029016494751,
          -0.06655353307723999,
          0.08282921463251114,
          0.07267313450574875,
          -0.074032261967659,
          0.01177668571472168,
          0.045377217233181,
          0.019361160695552826,
          -0.0064038485288619995,
          0.025649838149547577,
          -0.05703473836183548,
          0.0031593888998031616,
          0.06546954065561295,
          -0.05843197554349899,
          0.01844373345375061,
          -0.0034291893243789673,
          -0.035056110471487045,
          0.011685073375701904,
          -0.05220504850149155,
          -0.03556421771645546,
          0.07415012270212173,
          0.0673973485827446,
          0.0444895401597023,
          0.08004838973283768,
          0.002349838614463806,
          -0.07594174146652222,
          0.026170559227466583,
          -0.011182621121406555,
          -0.03782862052321434,
          0.003311626613140106,
          0.05559215694665909,
          -0.0003961026668548584,
          0.03616625815629959,
          -0.01372288167476654,
          -0.06341014802455902,
          0.06410124152898788,
          0.07045511156320572,
          0.056506700813770294,
          -0.07635438442230225,
          -0.013554640114307404,
          -0.08116141706705093,
          -0.010282166302204132,
          0.008894771337509155,
          0.012186184525489807,
          0.02114391326904297,
          0.06490505486726761,
          -0.01744905859231949,
          -0.01659107208251953,
          0.015632838010787964
        ],
        [
          -0.0024552643299102783,
          0.07860063761472702,
          -0.010265558958053589,
          0.04730234295129776,
          -0.03991997241973877,
          0.05846089869737625,
          0.04862474650144577,
          -0.07212705910205841,
          0.01579790562391281,
          0.03195212781429291,
          -0.046925146132707596,
          0.06770018488168716,
          -0.050726067274808884,
          0.04930522292852402,
          0.050230659544467926,
          0.006798870861530304,
          -0.03623250126838684,
          0.08350387960672379,
          -0.07465889304876328,
          0.022141896188259125,
          0.03546370565891266,
          -0.07567127794027328,
          0.07833749800920486,
          -0.007067747414112091,
          0.028752148151397705,
          -0.05570600926876068,
          -0.04014933854341507,
          -0.07732419669628143,
          0.02796138823032379,
          0.06376823037862778,
          -0.017493560910224915,
          -0.015283621847629547,
          0.018481239676475525,
          0.02889063209295273,
          0.03504299372434616,
          0.030675344169139862,
          -0.007739536464214325,
          0.08172256499528885,
          0.012851722538471222,
          -0.06812755763530731,
          0.024350568652153015,
          -0.037087976932525635,
          -0.05446217209100723,
          0.07155587524175644,
          0.08270315080881119,
          0.005463100969791412,
          -0.0053519606590271,
          -0.00971820205450058,
          -0.054533787071704865,
          0.023934870958328247,
          -0.018299199640750885,
          -0.07044480741024017,
          -0.03682897239923477,
          0.06219916790723801,
          -0.0714864730834961,
          0.028332926332950592,
          0.004542708396911621,
          0.029249466955661774,
          0.06072311848402023,
          0.04093562811613083,
          -0.04094088077545166,
          -0.036453764885663986,
          0.0633559599518776,
          -0.0012413933873176575
        ],
        [
          0.061291106045246124,
          -0.06086833029985428,
          -0.05072696879506111,
          -0.011546336114406586,
          0.02174747735261917,
          0.00352565199136734,
          0.026023060083389282,
          -0.05543811619281769,
          -0.02924010530114174,
          -0.0022328421473503113,
          0.06340036541223526,
          -0.006489641964435577,
          0.03797756880521774,
          0.06834045797586441,
          -0.030378073453903198,
          -0.06389772146940231,
          0.020953185856342316,
          0.08396796137094498,
          0.0035228431224823,
          0.017872698605060577,
          0.0833619013428688,
          -0.006197303533554077,
          0.07927697151899338,
          0.0643923208117485,
          0.013198629021644592,
          0.014061786234378815,
          0.022493518888950348,
          -0.02864355593919754,
          0.02615395188331604,
          -0.03158998116850853,
          0.0004279091954231262,
          0.048754118382930756,
          0.018163353204727173,
          0.01604730635881424,
          0.013565272092819214,
          0.035240694880485535,
          0.0698307529091835,
          -0.05862291902303696,
          -0.08151233196258545,
          -0.06461875140666962,
          -0.012816846370697021,
          0.08071892708539963,
          -0.01716245710849762,
          -0.03722637519240379,
          -0.026370424777269363,
          0.039561495184898376,
          -0.008901834487915039,
          0.07456602901220322,
          0.08077097684144974,
          0.0840684100985527,
          0.044776998460292816,
          0.057183168828487396,
          -0.03405998647212982,
          0.02625182271003723,
          -0.033934205770492554,
          0.08248687535524368,
          0.07731104642152786,
          0.019211694598197937,
          0.005942709743976593,
          0.013285964727401733,
          -0.008068978786468506,
          0.07959569245576859,
          -0.0505882129073143,
          -0.06152113527059555
        ],
        [
          -0.04801071062684059,
          0.050429411232471466,
          -0.002451874315738678,
          0.063654325902462,
          -0.053493987768888474,
          0.0077538564801216125,
          -0.0556747242808342,
          0.013104408979415894,
          0.004158578813076019,
          0.05725660175085068,
          0.0484883114695549,
          0.036062657833099365,
          -0.03775878995656967,
          0.035705819725990295,
          0.07922060042619705,
          0.0813228115439415,
          0.075104258954525,
          0.07674852758646011,
          -0.03757534921169281,
          -0.051310885697603226,
          0.0144742950797081,
          -0.04203302413225174,
          -0.06663307547569275,
          0.059424467384815216,
          0.04723415523767471,
          0.005901038646697998,
          0.017996154725551605,
          0.062376342713832855,
          -0.07941552996635437,
          0.040495604276657104,
          0.005669541656970978,
          0.014367863535881042,
          -0.0062207505106925964,
          -0.04115147888660431,
          0.02199411392211914,
          0.04308215528726578,
          -0.0743294358253479,
          0.051699332892894745,
          -0.08123670518398285,
          0.08064428716897964,
          0.010551922023296356,
          -0.01480264961719513,
          0.06350699812173843,
          -0.0028810501098632812,
          -0.03534357249736786,
          -0.0560716912150383,
          -0.007048994302749634,
          0.04934551566839218,
          -0.03976055979728699,
          -0.019189834594726562,
          0.026310063898563385,
          0.05917065590620041,
          -0.03183017671108246,
          0.022453688085079193,
          -0.019565418362617493,
          -0.0809168890118599,
          -0.08370371907949448,
          0.07100527733564377,
          0.03084593266248703,
          0.02610047161579132,
          0.01504942774772644,
          -0.03235354647040367,
          0.05747375637292862,
          -0.06723610311746597
        ],
        [
          0.08256296068429947,
          -0.02953946217894554,
          0.02158503234386444,
          -0.05663967877626419,
          0.02850174903869629,
          0.00329570472240448,
          -0.02778857946395874,
          0.02366698533296585,
          0.006086021661758423,
          -0.03285587951540947,
          0.046316422522068024,
          -7.741153240203857e-05,
          0.028599053621292114,
          0.05466332286596298,
          -0.01388319581747055,
          0.057831861078739166,
          0.07464397698640823,
          7.205456495285034e-05,
          0.029446929693222046,
          -0.00697103887796402,
          0.07757411152124405,
          -0.06618677824735641,
          0.009224914014339447,
          0.061691902577877045,
          0.004212401807308197,
          0.04353157430887222,
          0.024966932833194733,
          0.06829968839883804,
          0.04428950697183609,
          -0.024441014975309372,
          0.03734171390533447,
          0.06305188685655594,
          -0.02309602126479149,
          -0.07828343659639359,
          0.07659881561994553,
          0.05681545287370682,
          -0.06603774428367615,
          0.005161754786968231,
          0.018423162400722504,
          0.06180911511182785,
          0.05881538242101669,
          -0.0025892332196235657,
          0.009208068251609802,
          -0.00266159325838089,
          -0.07808511704206467,
          0.0225474014878273,
          -0.06135892868041992,
          -0.04695817828178406,
          -0.06846052408218384,
          0.05747965723276138,
          -0.03587650880217552,
          0.036655597388744354,
          -0.08234536647796631,
          0.06786664575338364,
          -0.04345398768782616,
          0.08001136034727097,
          -0.03470216318964958,
          -0.011201992630958557,
          -0.07709352672100067,
          0.05217244476079941,
          0.026866458356380463,
          -0.024373028427362442,
          -0.08057036250829697,
          0.07394623011350632
        ],
        [
          0.005401931703090668,
          0.01712840050458908,
          -0.025552593171596527,
          0.07317283004522324,
          0.04653672128915787,
          0.03988604247570038,
          0.00868947058916092,
          -0.050337545573711395,
          -0.020779050886631012,
          -0.06986355781555176,
          -0.03839821740984917,
          0.06761742383241653,
          0.05567073076963425,
          0.08122541755437851,
          0.027259573340415955,
          -0.010621711611747742,
          -0.06149546056985855,
          -0.03910978138446808,
          0.0587989017367363,
          0.00934530794620514,
          0.05810371786355972,
          -0.02308298647403717,
          0.0032631903886795044,
          -0.08164972811937332,
          0.04248758405447006,
          -0.015371225774288177,
          -0.04330110922455788,
          -0.03324398025870323,
          0.06555936485528946,
          -0.05250430479645729,
          -0.04452631622552872,
          0.06270723789930344,
          0.06995207816362381,
          0.02355244755744934,
          -0.03985830396413803,
          0.026318885385990143,
          -0.06940342485904694,
          -0.03613730147480965,
          0.008202783763408661,
          -0.06893063336610794,
          0.0007271692156791687,
          0.04499942809343338,
          0.053861819207668304,
          0.05531040579080582,
          -0.08102873712778091,
          0.0067422762513160706,
          -0.03205912187695503,
          -0.05832020938396454,
          0.0785878524184227,
          0.0556047186255455,
          -0.05343053489923477,
          -0.035320449620485306,
          0.02845802903175354,
          0.059930481016635895,
          -0.05078553035855293,
          -0.046090126037597656,
          0.05708844214677811,
          0.08213742822408676,
          -0.0045700594782829285,
          0.04913712292909622,
          -0.07413079589605331,
          0.05796263366937637,
          -0.0056432560086250305,
          0.05831294506788254
        ],
        [
          0.06187022477388382,
          0.07907187193632126,
          -0.019230201840400696,
          0.055161766707897186,
          0.08250536769628525,
          -0.06800879538059235,
          -0.03485993295907974,
          0.0027317628264427185,
          -0.046518877148628235,
          0.04712411016225815,
          -0.053444571793079376,
          -0.05841574817895889,
          0.04246770590543747,
          -0.078598253428936,
          -0.07780943810939789,
          0.08213140815496445,
          0.06641282886266708,
          -0.012982577085494995,
          0.03901509940624237,
          0.032702162861824036,
          -0.007633306086063385,
          0.0694596990942955,
          0.06348259001970291,
          -0.009326472878456116,
          0.06697940081357956,
          0.05773376673460007,
          0.007367581129074097,
          -0.017264217138290405,
          0.0407857745885849,
          -0.059718988835811615,
          0.03921671211719513,
          0.006180942058563232,
          -0.009428128600120544,
          0.05387597531080246,
          -0.08342315256595612,
          -0.03814021125435829,
          -0.05057936906814575,
          0.0505087748169899,
          -0.05360172316431999,
          -0.049468033015728,
          0.011766679584980011,
          -0.05595679581165314,
          0.031103111803531647,
          0.025950878858566284,
          0.05598082393407822,
          -0.06778963655233383,
          0.03908427059650421,
          0.040601812303066254,
          -0.01683097332715988,
          0.004001326858997345,
          -0.027593504637479782,
          0.038628146052360535,
          0.025787509977817535,
          -0.06122725084424019,
          -0.04802433028817177,
          -0.05027104541659355,
          -0.06424553692340851,
          -0.03186527267098427,
          0.05695084482431412,
          0.021602943539619446,
          -0.054530560970306396,
          -0.07814082503318787,
          -0.00597604364156723,
          0.020228393375873566
        ],
        [
          0.03720632195472717,
          0.02793876826763153,
          0.06388013809919357,
          -0.07533285766839981,
          -0.07061779499053955,
          0.05294119566679001,
          -0.01620473712682724,
          -0.04476955905556679,
          -0.041872747242450714,
          0.02111849933862686,
          0.010792620480060577,
          -0.015906862914562225,
          -0.006050407886505127,
          0.0739051029086113,
          -0.06393705308437347,
          -0.006029069423675537,
          0.006535172462463379,
          -0.013350747525691986,
          -0.08357222378253937,
          0.03493700176477432,
          -0.06803883612155914,
          -0.020889773964881897,
          0.08345360308885574,
          0.017617620527744293,
          -0.06074392795562744,
          -0.036339953541755676,
          -0.05787144601345062,
          0.004032514989376068,
          -0.05464822053909302,
          0.023163683712482452,
          -0.07568253576755524,
          0.026752591133117676,
          -0.03526337444782257,
          -0.014500565826892853,
          -0.08056001365184784,
          -0.023489538580179214,
          -0.023666121065616608,
          -0.08100149780511856,
          0.016796819865703583,
          0.020852074027061462,
          0.038351431488990784,
          0.0505446121096611,
          -0.08064313977956772,
          0.0184619277715683,
          -0.005499601364135742,
          0.0034014731645584106,
          0.07336238771677017,
          0.0609264150261879,
          0.05271277576684952,
          -0.048757851123809814,
          -0.051884811371564865,
          -0.058241475373506546,
          -0.08093289285898209,
          -0.027252335101366043,
          -0.01114422082901001,
          -0.039882510900497437,
          -0.04070650041103363,
          0.03309553116559982,
          -0.05591931194067001,
          0.08309290558099747,
          -0.02614661306142807,
          0.06924731284379959,
          0.007641613483428955,
          0.027632735669612885
        ],
        [
          0.07391000539064407,
          -0.032408278435468674,
          -0.06827421486377716,
          0.05439474433660507,
          -0.07985037565231323,
          -0.048193249851465225,
          -0.0756666287779808,
          -0.0048974379897117615,
          0.02501332014799118,
          0.054412536323070526,
          -0.01850927621126175,
          -0.04484221711754799,
          -0.06727077811956406,
          -0.007389523088932037,
          -0.016900382936000824,
          0.018113113939762115,
          0.0555463507771492,
          0.002017974853515625,
          0.01691409945487976,
          -0.06771382689476013,
          -0.0754181295633316,
          0.06977615505456924,
          -0.004970654845237732,
          0.017628207802772522,
          0.05023878067731857,
          -0.023486249148845673,
          0.05690097063779831,
          -0.021497473120689392,
          -0.0605112761259079,
          -0.02384023368358612,
          -0.08282914757728577,
          0.04512149840593338,
          -0.039652083069086075,
          -0.07154332846403122,
          -0.07655271142721176,
          -0.049388714134693146,
          0.024737924337387085,
          0.036437541246414185,
          0.05961181968450546,
          -0.026590365916490555,
          -0.013938553631305695,
          0.07149770110845566,
          -0.015758298337459564,
          -0.006814613938331604,
          0.005756460130214691,
          -0.014890432357788086,
          -0.03139868006110191,
          0.013286352157592773,
          0.0587826743721962,
          -0.05742117390036583,
          0.04820109158754349,
