{
  "model_type": "Sequential",
  "model_config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            784
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            784
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      784
    ]
  },
  "weights": [
    [
      [
        [
          -0.03826379030942917,
          0.018373824656009674,
          0.06098400801420212,
          0.0475250706076622,
          -0.04272976890206337,
          -0.058089278638362885,
          -0.0742846354842186,
          0.056631602346897125,
          0.0004078522324562073,
          0.011916249990463257,
          -0.06642065197229385,
          -0.0682859718799591,
          -0.0803554356098175,
          -0.06782001256942749,
          0.021795690059661865,
          0.009582750499248505,
          -0.036669135093688965,
          0.005694255232810974,
          0.010302536189556122,
          -0.009809091687202454,
          0.0034310519695281982,
          -0.0643434226512909,
          -0.04204878956079483,
          0.01978904753923416,
          0.01470482349395752,
          -0.032889191061258316,
          0.03398694843053818,
          -0.028397321701049805,
          0.05551769584417343,
          -0.018981263041496277,
          -0.015886150300502777,
          0.007433079183101654,
          -0.05692862719297409,
          0.015833325684070587,
          0.0014927536249160767,
          -0.03694426640868187,
          0.06567788869142532,
          -0.07947202026844025,
          -0.04011111706495285,
          -0.07320006936788559,
          0.019301235675811768,
          0.0593264177441597,
          -0.06910699605941772,
          0.020268522202968597,
          0.07069436460733414,
          -0.0749187245965004,
          -0.057500794529914856,
          -0.027743637561798096,
          0.060159169137477875,
          -0.06579827517271042,
          0.033315032720565796,
          -0.00038029998540878296,
          0.08034353703260422,
          -0.024831000715494156,
          -0.004822589457035065,
          0.007984668016433716,
          -0.044761937111616135,
          0.07550530880689621,
          -0.02607305347919464,
          -0.048527222126722336,
          -0.0338575541973114,
          -0.026045598089694977,
          -0.059613801538944244,
          -0.04991455003619194
        ],
        [
          -0.0014607533812522888,
          -0.08241919428110123,
          -0.04101119562983513,
          -0.036123864352703094,
          0.01874375343322754,
          0.07141216844320297,
          0.0424141064286232,
          0.016167595982551575,
          0.047364361584186554,
          0.07523969560861588,
          0.04189404100179672,
          0.0017457306385040283,
          -0.07774889469146729,
          -0.026041526347398758,
          0.06008603423833847,
          -0.05580700561404228,
          -0.010941527783870697,
          0.02052580565214157,
          -0.059930771589279175,
          0.0018919110298156738,
          0.03152584284543991,
          0.07800004631280899,
          -0.01899319887161255,
          0.03410370647907257,
          0.07505937665700912,
          0.06459405273199081,
          -0.02455994114279747,
          0.03383549302816391,
          -0.07952043414115906,
          -0.08365526795387268,
          -0.0679275318980217,
          -0.035489052534103394,
          -0.06281823664903641,
          0.055767036974430084,
          -0.03392516076564789,
          0.07836122065782547,
          0.02660057693719864,
          -0.03388916328549385,
          0.08124620467424393,
          0.020464174449443817,
          -0.043119531124830246,
          0.0548107847571373,
          0.04651779681444168,
          0.06850125640630722,
          0.0783604308962822,
          0.016453035175800323,
          0.06141319125890732,
          -0.0430203415453434,
          -0.002948075532913208,
          0.013993382453918457,
          0.07565023750066757,
          0.008505873382091522,
          -0.012128867208957672,
          -0.046702537685632706,
          0.07678798586130142,
          0.06928188353776932,
          -0.007062807679176331,
          0.04112374037504196,
          -0.026057228446006775,
          -0.004333294928073883,
          -0.01999553292989731,
          0.0481172576546669,
          -0.024037975817918777,
          0.03691418468952179
        ],
        [
          -0.01442098617553711,
          -0.04964487627148628,
          -0.011415258049964905,
          -0.043995603919029236,
          0.07574234157800674,
          -0.06006505340337753,
          0.01562684029340744,
          -0.06670874357223511,
          -0.0824376791715622,
          -0.05285694822669029,
          0.004948452115058899,
          0.059237219393253326,
          -0.08117751777172089,
          0.05046854168176651,
          0.005539834499359131,
          0.03219050168991089,
          0.017021290957927704,
          0.013040438294410706,
          -0.07316906750202179,
          0.07205959409475327,
          -0.03891095891594887,
          0.00012720376253128052,
          -0.01996070146560669,
          0.07726048678159714,
          0.08074630051851273,
          0.002577558159828186,
          -0.012096218764781952,
          -0.04562561586499214,
          0.054721273481845856,
          -0.06961975246667862,
          0.0026392489671707153,
          0.06479772180318832,
          -0.011274874210357666,
          -0.02699096128344536,
          0.02759348601102829,
          -0.07620421797037125,
          -0.06293267011642456,
          0.027722060680389404,
          0.059648312628269196,
          -0.05447592958807945,
          0.08058301359415054,
          0.008612722158432007,
          0.0521555170416832,
          0.08327425271272659,
          0.032646544277668,
          0.0581684485077858,
          0.07758898288011551,
          -0.04192332550883293,
          0.005167171359062195,
          0.05216900259256363,
          0.018335439264774323,
          0.03102259337902069,
          -0.0594012625515461,
          -0.06596945971250534,
          0.03833143413066864,
          0.034076035022735596,
          0.019761212170124054,
          0.07134822756052017,
          -0.018753163516521454,
          0.010550595819950104,
          0.0819801464676857,
          -0.010084882378578186,
          0.008368395268917084,
          -0.07452525198459625
        ],
        [
          0.025163769721984863,
          -0.03647809103131294,
          -0.027212847024202347,
          0.024607934057712555,
          0.012763358652591705,
          0.016004793345928192,
          -0.008521996438503265,
          0.023048490285873413,
          -0.07283332943916321,
          -0.0716753676533699,
          0.060818158090114594,
          -0.04681536555290222,
          -0.07966021448373795,
          -0.02432086691260338,
          -0.06369528919458389,
          0.04818207770586014,
          0.00786370038986206,
          -0.07934638112783432,
          -0.013218283653259277,
          -0.028026588261127472,
          -0.012374579906463623,
          0.06826236099004745,
          0.06803172081708908,
          0.06970512121915817,
          -0.01068093627691269,
          -0.05568152293562889,
          0.045077525079250336,
          0.027811363339424133,
          -0.025764048099517822,
          0.06919220834970474,
          -0.07060253620147705,
          -0.0683605968952179,
          -0.05282261595129967,
          -0.0329456627368927,
          0.01730925589799881,
          -0.0539444163441658,
          0.07176230102777481,
          -0.021191157400608063,
          0.056674398481845856,
          -0.009593784809112549,
          -0.017604179680347443,
          0.0688115581870079,
          -0.07988910377025604,
          -0.05747223645448685,
          -0.06457675993442535,
          -0.06945808976888657,
          0.05895731598138809,
          0.04763541370630264,
          -0.05913158506155014,
          0.008906245231628418,
          -0.0763007402420044,
          0.0566769614815712,
          -0.03936676308512688,
          0.03116369992494583,
          -0.039964694529771805,
          0.0471668466925621,
          -0.07087703049182892,
          -0.04267806559801102,
          -0.01608707755804062,
          -0.07443855702877045,
          0.04564610868692398,
          0.025780290365219116,
          -0.004382230341434479,
          0.07919364422559738
        ],
        [
          0.03401891887187958,
          -0.02289850264787674,
          0.05656961351633072,
          -0.004772715270519257,
          0.07348965853452682,
          0.01706767827272415,
          0.026085607707500458,
          -0.06759181618690491,
          -0.07037246972322464,
          -0.005061306059360504,
          -0.04006502777338028,
          -0.07594470679759979,
          0.05533625930547714,
          -0.04550901800394058,
          0.07391432672739029,
          -0.054213374853134155,
          -0.024145707488059998,
          0.011111706495285034,
          0.01772575080394745,
          0.07589764147996902,
          0.028158150613307953,
          0.022126249969005585,
          -0.03360382094979286,
          0.015651129186153412,
          -0.07894822955131531,
          0.08352663367986679,
          0.04006423056125641,
          0.06839416176080704,
          0.007511056959629059,
          0.04062734544277191,
          0.0027353093028068542,
          -0.06840717792510986,
          0.007912591099739075,
          0.04292554408311844,
          -0.04056830331683159,
          0.029561176896095276,
          0.06401026993989944,
          -0.05603731423616409,
          -0.007937781512737274,
          0.0817749872803688,
          -0.042691685259342194,
          0.0713924691081047,
          0.07218954712152481,
          0.08046359568834305,
          -0.011380165815353394,
          -0.08223328739404678,
          -0.05401027947664261,
          -0.007521465420722961,
          0.0031299665570259094,
          -0.037769097834825516,
          -0.042429327964782715,
          -0.07597232609987259,
          -0.06254541128873825,
          -0.04501192271709442,
          0.027002528309822083,
          -0.009693458676338196,
          -0.06429100036621094,
          0.014277957379817963,
          -0.06604645401239395,
          0.00257226824760437,
          0.06507398933172226,
          0.07545173913240433,
          0.07745534926652908,
          -0.02107066661119461
        ],
        [
          -0.013299703598022461,
          -0.061921264976263046,
          0.0342949703335762,
          -0.03327271714806557,
          -0.023084048181772232,
          -0.03705589100718498,
          -0.04398585855960846,
          0.053771160542964935,
          0.056140534579753876,
          0.04143641144037247,
          0.0752195343375206,
          0.07305417209863663,
          0.041529737412929535,
          -0.01238773763179779,
          -0.012427806854248047,
          0.07323803752660751,
          0.03293818235397339,
          -0.052428800612688065,
          0.02850433439016342,
          -0.04530433937907219,
          -0.02951274812221527,
          -0.07547600567340851,
          -0.002596147358417511,
          0.05121470242738724,
          0.0008744671940803528,
          0.048587433993816376,
          -0.019776977598667145,
          0.03670743852853775,
          -0.010920889675617218,
          -0.08093477785587311,
          -0.025421474128961563,
          0.07091595977544785,
          0.0012183859944343567,
          -0.06364762037992477,
          -0.043303072452545166,
          0.057244859635829926,
          0.01080641895532608,
          -0.016884014010429382,
          0.0001254454255104065,
          -0.05672669783234596,
          0.07125527411699295,
          0.057458482682704926,
          0.07741383463144302,
          -0.08171463012695312,
          0.06512296944856644,
          0.046243079006671906,
          0.0014555975794792175,
          -0.0743822231888771,
          -0.06810958683490753,
          0.048839740455150604,
          -0.04846557229757309,
          -0.009131960570812225,
          0.024090655148029327,
          -0.02802037075161934,
          -0.00421934574842453,
          -0.01352500170469284,
          0.07648346573114395,
          0.06832780689001083,
          0.07822253555059433,
          -0.07184284180402756,
          -0.01735275238752365,
          0.021991707384586334,
          0.07620898634195328,
          -0.0345306321978569
        ],
        [
          0.044058315455913544,
          -0.06723718345165253,
          -0.07832594960927963,
          0.010129988193511963,
          -0.06687210500240326,
          -0.06968314945697784,
          -0.02152649313211441,
          -0.03137138485908508,
          0.03232739865779877,
          0.021730393171310425,
          -0.015017054975032806,
          -0.007508128881454468,
          0.004183605313301086,
          0.07922648638486862,
          -0.013046413660049438,
          0.061411626636981964,
          0.07700078934431076,
          -0.017585568130016327,
          0.08012381941080093,
          0.07369951158761978,
          0.08266622573137283,
          0.015355020761489868,
          -0.009884357452392578,
          0.059628866612911224,
          -0.007191799581050873,
          0.03510361909866333,
          0.06295698136091232,
          -0.0624476820230484,
          -0.010553203523159027,
          0.041680388152599335,
          -0.044576212763786316,
          -0.026825007051229477,
          0.034792110323905945,
          0.04249795526266098,
          0.047125376760959625,
          0.005265124142169952,
          -0.01072712242603302,
          0.060707949101924896,
          -0.059288132935762405,
          0.058372847735881805,
          0.06462810188531876,
          0.0091346874833107,
          0.08384538441896439,
          -0.05265014246106148,
          0.013068333268165588,
          -0.06739477813243866,
          0.015131525695323944,
          0.06465338915586472,
          -0.028484158217906952,
          0.03348896652460098,
          0.023759573698043823,
          -0.07757522165775299,
          0.013447970151901245,
          0.06827493757009506,
          0.07472754269838333,
          -0.0029575005173683167,
          0.07455096393823624,
          -0.007104083895683289,
          0.03248556703329086,
          0.031761571764945984,
          0.017739228904247284,
          0.009862072765827179,
          0.06044264882802963,
          -0.021165408194065094
        ],
        [
          0.015309631824493408,
          -0.08315856754779816,
          -0.06592299789190292,
          0.030206158757209778,
          0.008130349218845367,
          0.00015558302402496338,
          0.019846990704536438,
          -0.08406290411949158,
          -0.04205789417028427,
          0.055339060723781586,
          -0.004394158720970154,
          0.027537554502487183,
          -0.07773056626319885,
          -0.0049022287130355835,
          -0.027689769864082336,
          -0.00047919154167175293,
          0.050485916435718536,
          -0.051786746829748154,
          -0.02150329202413559,
          0.022690512239933014,
          -0.026084907352924347,
          0.07778216153383255,
          -0.06578273326158524,
          0.07743861526250839,
          0.04545048624277115,
          0.07634276896715164,
          0.043596141040325165,
          -0.012924417853355408,
          0.036532580852508545,
          0.059606827795505524,
          0.056688807904720306,
          0.052794404327869415,
          0.02282199263572693,
          -0.07658704370260239,
          0.02649618685245514,
          -0.03981709107756615,
          0.026958711445331573,
          -0.07760406285524368,
          0.038849227130413055,
          -0.08112254738807678,
          0.05552675575017929,
          0.006497904658317566,
          -0.012757405638694763,
          -0.03987390920519829,
          0.052135713398456573,
          -0.0493752583861351,
          -0.05422360077500343,
          -0.01930827647447586,
          -0.07157208770513535,
          -0.0022991225123405457,
          0.04300554841756821,
          -0.024737484753131866,
          -0.04384976625442505,
          0.00430750846862793,
          0.05779469758272171,
          0.07778743654489517,
          0.04397759586572647,
          0.04254969209432602,
          -0.05033835023641586,
          -0.056801460683345795,
          0.074940524995327,
          -0.025017429143190384,
          0.030138500034809113,
          0.008582398295402527
        ],
        [
          0.04827188700437546,
          0.020559310913085938,
          -0.010521434247493744,
          -0.059209175407886505,
          0.08373264223337173,
          0.07781962305307388,
          0.05825401097536087,
          0.0565989688038826,
          -0.03591256961226463,
          0.01238001137971878,
          -0.004132188856601715,
          -0.05864208936691284,
          0.07287352532148361,
          -0.055085957050323486,
          -0.06772766262292862,
          0.04348871856927872,
          -0.07425393164157867,
          0.03628671169281006,
          0.04602145403623581,
          0.08325114101171494,
          0.04397737234830856,
          0.08397079259157181,
          0.05469395965337753,
          -0.0025697797536849976,
          0.03672364354133606,
          0.07998562604188919,
          0.0710316076874733,
          0.04903122037649155,
          -0.07491489499807358,
          -0.004199773073196411,
          -0.02203582599759102,
          0.01453680545091629,
          0.03882945328950882,
          0.08383933454751968,
          0.0829378291964531,
          -0.009925350546836853,
          0.006080828607082367,
          -0.07151857763528824,
          0.0046192556619644165,
          -0.04769781604409218,
          -0.040088675916194916,
          -0.05156048759818077,
          -0.0514807291328907,
          0.08046896010637283,
          0.07146900147199631,
          0.025860734283924103,
          -0.003915511071681976,
          0.028050675988197327,
          -0.0022197216749191284,
          -0.07838581502437592,
          0.04684329777956009,
          0.055027298629283905,
          0.019796229898929596,
          0.06715526431798935,
          -0.07597587257623672,
          -0.027350563555955887,
          0.04513632506132126,
          -0.0047857314348220825,
          -0.06341364234685898,
          -0.044062867760658264,
          0.06657350808382034,
          0.031758420169353485,
          -0.02571728080511093,
          -0.06638193130493164
        ],
        [
          -0.08095274865627289,
          -0.06693532317876816,
          -0.03711100295186043,
          -0.038916170597076416,
          -0.04734507203102112,
          -0.027834907174110413,
          -0.03469887375831604,
          -0.06377396732568741,
          0.01359240710735321,
          -0.037001561373472214,
          -0.0572708435356617,
          0.0724744126200676,
          -0.014618203043937683,
          0.06875257939100266,
          -0.06495194137096405,
          -0.05072428286075592,
          0.02281198650598526,
          0.010140113532543182,
          -0.07407772541046143,
          0.012540452182292938,
          -0.01877925544977188,
          0.03431161493062973,
          0.0023101717233657837,
          0.012534856796264648,
          -0.008745886385440826,
          -0.030016262084245682,
          0.08265648037195206,
          -0.08096572011709213,
          -0.007354550063610077,
          -0.039145760238170624,
          -0.011279165744781494,
          0.0721011534333229,
          -0.04317859187722206,
          0.04822162538766861,
          0.008578352630138397,
          -0.03924473002552986,
          0.036870285868644714,
          -0.028027530759572983,
          0.08270149677991867,
          0.020386040210723877,
          -0.07580472528934479,
          0.08166194707155228,
          -0.0056043267250061035,
          -0.06684483587741852,
          -0.04459751024842262,
          0.03452996909618378,
          -0.07251884788274765,
          -0.06779514998197556,
          0.019536137580871582,
          0.07212556153535843,
          -0.06418460607528687,
          -0.009173855185508728,
          0.047374360263347626,
          0.044228918850421906,
          0.011691570281982422,
          -0.02773832157254219,
          -0.004446543753147125,
          -0.06422018259763718,
          0.07800006121397018,
          -0.009227760136127472,
          -0.025323685258626938,
          0.02662433683872223,
          0.043861545622348785,
          -0.02025875449180603
        ],
        [
          0.04941172152757645,
          0.021497994661331177,
          -0.04743277281522751,
          -0.003471843898296356,
          0.07046466320753098,
          0.044300444424152374,
          0.026246488094329834,
          -0.04652958735823631,
          0.07728532701730728,
          0.009526081383228302,
          -0.005636192858219147,
          -0.0005105361342430115,
          0.03947678208351135,
          0.036031730473041534,
          0.04264887422323227,
          0.017680086195468903,
          0.04340381175279617,
          -0.060351818799972534,
          -0.00596415251493454,
          -0.00817350298166275,
          -0.02338045835494995,
          -0.02776792272925377,
          0.06481292098760605,
          0.05977384001016617,
          -0.00540497899055481,
          -0.0708143338561058,
          0.07007018476724625,
          0.05655928701162338,
          -0.03665463626384735,
          0.009827561676502228,
          0.0757574513554573,
          0.07048515230417252,
          0.006932653486728668,
          -0.00015833228826522827,
          -0.08009614795446396,
          0.08109316974878311,
          0.08373887091875076,
          -0.02544393390417099,
          0.018816933035850525,
          0.05635387450456619,
          -0.0736532062292099,
          -0.02324998378753662,
          -0.02843514457345009,
          0.009048938751220703,
          0.02481883019208908,
          0.007704384624958038,
          -0.029323551803827286,
          0.04624370485544205,
          0.04675403982400894,
          -0.07989658415317535,
          0.003311842679977417,
          -0.04302862286567688,
          -0.054875340312719345,
          -0.0777844712138176,
          -0.024644751101732254,
          0.05278041213750839,
          -0.07028025388717651,
          -0.01692015677690506,
          -0.030237067490816116,
          -0.0797804668545723,
          -0.08050055056810379,
          -0.058928411453962326,
          0.052505768835544586,
          0.04734387248754501
        ],
        [
          -0.06688464432954788,
          -0.040918540209531784,
          -0.039884377270936966,
          0.002251468598842621,
          0.046748943626880646,
          0.06305082887411118,
          -0.028518132865428925,
          -0.005978390574455261,
          0.056682758033275604,
          0.0651099905371666,
          0.037151895463466644,
          -0.08304191380739212,
          0.05820082873106003,
          0.016222625970840454,
          -0.06634023785591125,
          0.04128516465425491,
          -0.026729386299848557,
          -0.013665623962879181,
          0.005802810192108154,
          0.044798798859119415,
          -0.04115131497383118,
          -0.02503323182463646,
          -0.06084500625729561,
          -0.06920234858989716,
          0.062427543103694916,
          0.004678860306739807,
          0.016003713011741638,
          -0.02264198288321495,
          0.06357506662607193,
          0.06355097144842148,
          0.0695282593369484,
          -0.04493409022688866,
          -0.026369724422693253,
          0.019151605665683746,
          -0.013610854744911194,
          -0.0773094967007637,
          0.013231299817562103,
          0.04451680928468704,
          -0.041575536131858826,
          0.07367127388715744,
          -0.05702517181634903,
          -0.0744086354970932,
          -0.04508734866976738,
          0.04785073548555374,
          -0.015370622277259827,
          -0.06235679239034653,
          0.04989830404520035,
          0.031329311430454254,
          -0.028901219367980957,
          -0.02543751895427704,
          -0.003310844302177429,
          0.003632679581642151,
          0.008508577942848206,
          -0.016571521759033203,
          0.02739713340997696,
          0.033973127603530884,
          0.011948153376579285,
          -0.042040444910526276,
          0.004064120352268219,
          -0.024360675364732742,
          -0.06349105387926102,
          -0.04551836475729942,
          -0.024867720901966095,
          0.05286533385515213
        ],
        [
          0.07654669135808945,
          -0.06943729519844055,
          0.04288693517446518,
          0.03523530066013336,
          -0.05763930827379227,
          0.07423367351293564,
          -0.06076262146234512,
          -0.07767870277166367,
          -0.07257615029811859,
          -0.04736224189400673,
          -0.014597147703170776,
          -0.07841601967811584,
          -0.040146131068468094,
          -0.03994584456086159,
          0.006480462849140167,
          -0.0026043951511383057,
          0.057632558047771454,
          -0.08390109986066818,
          -0.01261942833662033,
          -0.060898132622241974,
          0.06590426713228226,
          0.0785842165350914,
          -0.03989303857088089,
          -0.07943899184465408,
          -0.03252344951033592,
          0.03674530237913132,
          -0.06826017796993256,
          0.03080882877111435,
          0.052882321178913116,
          -0.02183714509010315,
          -0.011886261403560638,
          0.07584825903177261,
          -0.050285704433918,
          -0.07687302678823471,
          0.0509345605969429,
          -0.05401037633419037,
          0.04495740681886673,
          -0.028394535183906555,
          -0.029631834477186203,
          -0.010741479694843292,
          -0.008552998304367065,
          -0.03633684664964676,
          0.008166462182998657,
          0.016652479767799377,
          0.07459505647420883,
          0.020178429782390594,
          0.0051383376121521,
          0.023047469556331635,
          -0.0054054856300354,
          0.007126547396183014,
          -0.03386455401778221,
          0.06355097144842148,
          0.05332554131746292,
          -0.0609644316136837,
          -0.05172142758965492,
          -0.08216667920351028,
          -0.05058179423213005,
          -0.030842840671539307,
          -0.03863482177257538,
          -0.014428488910198212,
          -0.06155971810221672,
          -0.034165818244218826,
          0.0028580278158187866,
          -0.01095765084028244
        ],
        [
          0.01312185823917389,
          0.024322152137756348,
          0.06846236437559128,
          0.05306250602006912,
          0.029522337019443512,
          0.014354705810546875,
          0.06455700844526291,
          -0.01966845989227295,
          0.03538462519645691,
          -0.022680848836898804,
          0.04972945898771286,
          0.07013959437608719,
          -0.051822081208229065,
          -0.008266881108283997,
          -0.06772732734680176,
          -0.009317807853221893,
          -0.039619412273168564,
          0.021238327026367188,
          0.03148884326219559,
          -0.019929133355617523,
          0.007188074290752411,
          -0.02533106505870819,
          0.061689577996730804,
          0.04399070888757706,
          -0.060178786516189575,
          0.03929552435874939,
          0.048373885452747345,
          0.06866522878408432,
          -0.031211789697408676,
          0.02487511932849884,
          -0.019415147602558136,
          0.001819908618927002,
          0.03313817083835602,
          0.07131122797727585,
          0.04142173379659653,
          -0.010258398950099945,
          -0.03440459072589874,
          -0.026625823229551315,
          0.07301289588212967,
          0.08002028614282608,
          0.009881749749183655,
          -0.08130093663930893,
          -0.06734489649534225,
          0.03293736279010773,
          -0.013678759336471558,
          -0.052549246698617935,
          -0.06713777780532837,
          0.0322427824139595,
          -0.08322016149759293,
          -0.07887615263462067,
          -0.06741629540920258,
          -0.004439607262611389,
          0.03125172108411789,
          0.08125071972608566,
          -0.07449352741241455,
          -0.0598827600479126,
          0.06388818472623825,
          -0.014521420001983643,
          -0.007156088948249817,
          0.08207192271947861,
          -0.054788704961538315,
          0.035050153732299805,
          0.029195643961429596,
          0.07045222073793411
        ],
        [
          -0.04244934022426605,
          0.050362296402454376,
          0.03049188107252121,
          0.0075250715017318726,
          0.002833157777786255,
          0.042802564799785614,
          0.04258862882852554,
          0.002778187394142151,
          0.07716014236211777,
          0.057495854794979095,
          -0.07727184891700745,
          0.02236992120742798,
          0.02685941755771637,
          0.07506351917982101,
          -0.012768417596817017,
          -0.005815185606479645,
          0.018741048872470856,
          -0.011737421154975891,
          0.00259602814912796,
          0.08051323145627975,
          -0.01098853349685669,
          0.03276100009679794,
          0.04390942305326462,
          -0.0108981654047966,
          -0.06112625449895859,
          -0.083525650203228,
          -0.004801414906978607,
          -0.07583460956811905,
          -0.025928236544132233,
          0.005715169012546539,
          0.06479338556528091,
          0.06359311193227768,
          -0.032965559512376785,
          0.06744370609521866,
          0.04893126338720322,
          0.06323202699422836,
          0.0639650747179985,
          -0.024581842124462128,
          -0.0829855352640152,
          0.06203304976224899,
          -0.04818549007177353,
          0.06330382078886032,
          -0.06326678395271301,
          -0.03582994267344475,
          0.023554757237434387,
          -0.014704622328281403,
          -0.07065881043672562,
          -0.015066653490066528,
          0.006870783865451813,
          0.07199805229902267,
          0.06385087221860886,
          -0.0458173006772995,
          -0.07258421182632446,
          0.010396718978881836,
          -0.07667259871959686,
          0.039620235562324524,
          -0.07409533858299255,
          -0.07943564653396606,
          0.006576605141162872,
          0.0783226415514946,
          0.07267703860998154,
          -0.08052489906549454,
          -0.08060672134160995,
          -0.07556948065757751
        ],
        [
          -0.05635969340801239,
          0.06150449067354202,
          -0.0009216591715812683,
          0.06511814147233963,
          0.053065843880176544,
          -0.047052133828401566,
          -0.001452423632144928,
          0.008125051856040955,
          -4.925578832626343e-05,
          0.015856832265853882,
          -0.06005185842514038,
          -0.052450116723775864,
          -0.017213694751262665,
          0.06272616237401962,
          -0.036118488758802414,
          0.05306737869977951,
          0.03871293365955353,
          -0.058617621660232544,
          -0.030699729919433594,
          -0.015481002628803253,
          0.03322315961122513,
          0.05297810584306717,
          0.03603309392929077,
          0.039414793252944946,
          0.0467299148440361,
          0.042234040796756744,
          0.016321957111358643,
          -0.036568380892276764,
          0.005111478269100189,
          -0.043701641261577606,
          0.03025505691766739,
          -0.04047328606247902,
          0.0020728781819343567,
          -0.06488556414842606,
          0.03618142008781433,
          0.06863861531019211,
          0.07206759601831436,
          -0.07278848439455032,
          -0.058405645191669464,
          0.07613065093755722,
          0.07442634552717209,
          0.05733051151037216,
          0.046400196850299835,
          0.07936441153287888,
          -0.013220667839050293,
          -0.031379565596580505,
          0.020612597465515137,
          -0.044599372893571854,
          0.033724069595336914,
          0.017296284437179565,
          0.04913315922021866,
          -0.0057087913155555725,
          -0.057842906564474106,
          -0.07148055732250214,
          -0.04759537801146507,
          -0.047842029482126236,
          -0.03264353796839714,
          0.05747371166944504,
          -0.0712226927280426,
          0.009030327200889587,
          0.0774121955037117,
          -0.06298701465129852,
          -0.04385421797633171,
          -0.03976202383637428
        ],
        [
          -0.015857450664043427,
          -0.04881870001554489,
          0.02550472319126129,
          0.07004367560148239,
          -0.024887334555387497,
          -0.053288646042346954,
          0.0716242715716362,
          -0.05665263533592224,
          -0.0710207000374794,
          0.018296509981155396,
          -0.02748529240489006,
          -0.018574193120002747,
          -0.033965930342674255,
          0.05802159756422043,
          0.07688035815954208,
          -0.05026679486036301,
          0.016308940947055817,
          0.015478454530239105,
          0.07697287946939468,
          0.05772889405488968,
          0.036391615867614746,
          -0.005004428327083588,
          -0.003960259258747101,
          0.040211647748947144,
          0.028504274785518646,
          -0.024809762835502625,
          -0.08345353603363037,
          0.07248309999704361,
          0.021629013121128082,
          0.05749183148145676,
          0.07860124856233597,
          0.05317816883325577,
          0.04426588863134384,
          0.07923375815153122,
          -0.06361708045005798,
          0.006536796689033508,
          -0.04227558895945549,
          0.04055889695882797,
          -0.05971056967973709,
          0.013858772814273834,
          0.04546587914228439,
          0.06835583597421646,
          0.08114136010408401,
          -0.06251589208841324,
          0.0677952840924263,
          -0.008167952299118042,
          -0.0614103302359581,
          0.051127247512340546,
          0.06646812707185745,
          0.07851534336805344,
          -0.05839499458670616,
          0.054090239107608795,
          -0.06980670243501663,
          -0.02359851449728012,
          -0.013460084795951843,
          -0.05188264697790146,
          -0.015007451176643372,
          -0.08359719067811966,
          -0.03509315103292465,
          -0.058575667440891266,
          -0.025832176208496094,
          -0.0485416017472744,
          -0.033680349588394165,
          -0.05906560644507408
        ],
        [
          -0.015655778348445892,
          0.021653063595294952,
          -0.057356055825948715,
          0.06792887300252914,
          -0.07545875757932663,
          -0.006578728556632996,
          -0.058899592608213425,
          -0.05444187670946121,
          -0.07395081967115402,
          0.07663802057504654,
          0.024497471749782562,
          -0.02590082213282585,
          -0.04098097234964371,
          0.028994716703891754,
          0.05962427705526352,
          0.019650451838970184,
          0.05840947479009628,
          -0.019066594541072845,
          0.023496218025684357,
          -0.08307957649230957,
          -0.06165523827075958,
          -0.08403412252664566,
          -0.06798289716243744,
          0.036524802446365356,
          0.07010247558355331,
          0.013535350561141968,
          0.0195838063955307,
          0.03406991809606552,
          0.02674809843301773,
          -0.06518936902284622,
          -0.03388440981507301,
          0.05635502189397812,
          0.050051890313625336,
          0.043678946793079376,
          -0.04564452916383743,
          -0.0513046495616436,
          -0.06215336173772812,
          -0.012312792241573334,
          -0.04889765381813049,
          0.04484551399946213,
          -0.05829063057899475,
          0.03546711057424545,
          -0.026865798979997635,
          0.03062809258699417,
          0.0060982778668403625,
          0.051579512655735016,
          -0.04656720906496048,
          -0.08020017296075821,
          0.052798785269260406,
          -0.02766355872154236,
          -0.015938952565193176,
          -0.028654422610998154,
          -0.07078254967927933,
          -0.017124593257904053,
          -0.07991012185811996,
          0.039231911301612854,
          -0.06325976550579071,
          -0.01377779245376587,
          0.04404864460229874,
          0.0723198726773262,
          -0.04713919013738632,
          -0.07318197935819626,
          0.0326506569981575,
          -0.05285618454217911
        ],
        [
          0.01757688820362091,
          -0.009920775890350342,
          -0.02960054948925972,
          -0.03562181442975998,
          0.06107950955629349,
          -0.029544353485107422,
          -0.06604671478271484,
          0.05632730573415756,
          -0.06291893124580383,
          -0.0340813472867012,
          0.02126263827085495,
          -0.060998402535915375,
          -0.022989850491285324,
          0.07101715356111526,
          0.0804930254817009,
          0.027756914496421814,
          0.08106551319360733,
          0.07206062227487564,
          0.003931418061256409,
          -0.021707408130168915,
          -0.010669402778148651,
          0.0545397624373436,
          -0.08224872499704361,
          0.07655348628759384,
          -0.04208268225193024,
          0.015183791518211365,
          -0.008965790271759033,
          0.0736013874411583,
          -0.024892427027225494,
          0.00046693533658981323,
          -0.07054197043180466,
          -0.043560177087783813,
          -0.004014782607555389,
          -0.03974084556102753,
          0.049916915595531464,
          -0.056398823857307434,
          0.021603867411613464,
          0.06165439635515213,
          -0.052181582897901535,
          -0.03801098093390465,
          -0.04547719284892082,
          -0.03131350502371788,
          0.010892890393733978,
          0.06373321264982224,
          -0.056037094444036484,
          -0.00701557844877243,
          -0.019865617156028748,
          0.029199309647083282,
          0.036437056958675385,
          -0.0023433417081832886,
          0.08071915060281754,
          -0.02539273351430893,
          0.0699191465973854,
          0.019067637622356415,
          0.03315477818250656,
          0.0653403028845787,
          0.06132688373327255,
          -0.01784588396549225,
          -0.04328387975692749,
          -0.07055097818374634,
          0.03819520026445389,
          -0.05816303938627243,
          -0.056675054132938385,
          -0.04213033244013786
        ],
        [
          0.08265740424394608,
          -0.07395489513874054,
          0.06482154875993729,
          -0.0760997086763382,
          -0.006520010530948639,
          0.052770473062992096,
          0.041025497019290924,
          -0.017813555896282196,
          0.08289817720651627,
          -0.03615884110331535,
          0.05035153776407242,
          0.031108446419239044,
          0.04099876433610916,
          0.026176996529102325,
          0.08347403258085251,
          0.04126621037721634,
          0.024591445922851562,
          -0.0740644708275795,
          0.05235380679368973,
          0.07223611325025558,
          -0.08081109821796417,
          0.038104377686977386,
          0.07239014655351639,
          0.060422055423259735,
          -0.076834537088871,
          -0.04872191324830055,
          0.0599231943488121,
          -0.02799101173877716,
          -0.05911293625831604,
          0.035778939723968506,
          -0.057881951332092285,
          -0.036480359733104706,
          -0.0656333863735199,
          0.03129519522190094,
          0.06904686242341995,
          0.05734635144472122,
          -0.010436929762363434,
          0.06584777683019638,
          -0.035196393728256226,
          0.023768723011016846,
          0.029474183917045593,
          -0.024035830050706863,
          -0.0621454194188118,
          -0.00924992561340332,
          -0.032326895743608475,
          0.0667664185166359,
          -0.02057415246963501,
          -0.04734709858894348,
          -0.03982720151543617,
          0.05351553112268448,
          0.019383884966373444,
          0.03394541144371033,
          0.015942923724651337,
          -0.007961481809616089,
          -0.04357194900512695,
          0.08339748531579971,
          -0.05789731442928314,
          0.032209210097789764,
          -0.06734917312860489,
          0.06894280761480331,
          -0.027530312538146973,
          -0.014196693897247314,
          -0.06316247582435608,
          0.08260916918516159
        ],
        [
          0.016874387860298157,
          0.05022161453962326,
          -0.07369464635848999,
          0.07011953741312027,
          -0.06229843571782112,
          0.018425747752189636,
          0.03274749964475632,
          0.01318436861038208,
          -0.026561547070741653,
          -0.023968465626239777,
          -0.01964888721704483,
          -0.06618809700012207,
          0.07640344649553299,
          0.06636574119329453,
          -0.038217443972826004,
          0.012364670634269714,
          0.039939768612384796,
          -0.06504624336957932,
          0.08207324892282486,
          -0.015353232622146606,
          0.08078240603208542,
          0.013032756745815277,
          -0.018201574683189392,
          0.03212849050760269,
          0.034990713000297546,
          -0.05239051580429077,
          0.07504158467054367,
          0.07678250223398209,
          0.032136574387550354,
          -0.03604093939065933,
          -0.06505751609802246,
          -0.025914181023836136,
          -0.07468895614147186,
          0.044470541179180145,
          -0.08073180168867111,
          0.007542841136455536,
          -0.03446323052048683,
          -0.03043779358267784,
          0.0008849576115608215,
          -0.03931596502661705,
          0.051793284714221954,
          0.08310253173112869,
          0.04770294576883316,
          0.03208088129758835,
          0.07709043473005295,
          -0.0598180815577507,
          -0.06254555284976959,
          -0.017087571322917938,
          -0.05982086807489395,
          -0.01895461231470108,
          -0.0084499791264534,
          0.07080297917127609,
          0.0359470397233963,
          0.06640266627073288,
          -0.014587059617042542,
          -0.012268409132957458,
          -0.0782817080616951,
          0.03643106669187546,
          -0.025169767439365387,
          -0.056180909276008606,
          -0.04478845000267029,
          -0.051125418394804,
          -0.05660121515393257,
          -0.017043009400367737
        ],
        [
          0.015685461461544037,
          -0.07281847298145294,
          -0.029212187975645065,
          -0.013572648167610168,
          0.03615996241569519,
          -0.026922613382339478,
          -0.016287870705127716,
          0.06623909622430801,
          -0.02763453871011734,
          -0.02070118486881256,
          -0.0777750089764595,
          -0.07375376671552658,
          0.0537087544798851,
          0.05480451136827469,
          -0.0032268911600112915,
          0.04703667014837265,
          -0.04292237386107445,
          0.021257899701595306,
          -0.024857714772224426,
          0.07415974885225296,
          -0.08073025941848755,
          0.0723712220788002,
          0.07781077176332474,
          0.011511579155921936,
          0.08360683172941208,
          -0.04485320672392845,
          -0.057456910610198975,
          0.06553453952074051,
          -0.02371535450220108,
          -0.05383678525686264,
          -0.006809860467910767,
          -0.025046467781066895,
          -0.04816170409321785,
          -0.02862955629825592,
          -0.05142952874302864,
          0.03305085003376007,
          -0.021908476948738098,
          -0.0620599240064621,
          -0.08367098867893219,
          0.07280132919549942,
          -0.04369071125984192,
          -0.06076093763113022,
          -0.039405807852745056,
          0.04254459589719772,
          -0.0638088583946228,
          -0.013253599405288696,
          0.07215660065412521,
          -0.06383384764194489,
          -0.047479160130023956,
          0.0210142582654953,
          0.035943254828453064,
          -0.014849595725536346,
          0.08355436474084854,
          0.05012042075395584,
          0.0259690061211586,
          -0.015383176505565643,
          -0.06170415133237839,
          0.014336414635181427,
          0.047308556735515594,
          -0.06771218031644821,
          -0.05821315944194794,
          -0.042216625064611435,
          0.06922847777605057,
          0.055716224014759064
        ],
        [
          0.08216980844736099,
          0.019671067595481873,
          -0.011545933783054352,
          -0.07788163423538208,
          -0.06532275676727295,
          -0.021925125271081924,
          0.007223151624202728,
          -0.06336719542741776,
          -0.027867954224348068,
          -0.053998567163944244,
          -0.035614512860774994,
          -0.07237501442432404,
          -0.015123724937438965,
          -0.00867723673582077,
          0.06705658882856369,
          0.004338890314102173,
          -0.07169100642204285,
          -0.039818957448005676,
          -0.041872307658195496,
          -0.028214160352945328,
          0.035144269466400146,
          -0.03997119516134262,
          -0.06062053143978119,
          -0.04099615290760994,
          -0.06223205476999283,
          0.026409372687339783,
          -0.0816037654876709,
          0.056210510432720184,
          -0.05618886649608612,
          0.059056662023067474,
          0.0006892606616020203,
          0.051085375249385834,
          0.0007041245698928833,
          -0.04680604115128517,
          -0.05842367187142372,
          -0.051755018532276154,
          0.07974585145711899,
          -0.0573057197034359,
          0.05461675673723221,
          0.02070339024066925,
          -0.021079592406749725,
          0.037392713129520416,
          -0.042966071516275406,
          -0.0800112783908844,
          -0.04387044161558151,
          0.0784488245844841,
          0.02028394490480423,
          -0.01245357096195221,
          0.033779360353946686,
          0.0036603137850761414,
