{
  "model_type": "Sequential",
  "model_config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": {
        "name": "float32"
      },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            784
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            784
          ]
        }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      }
    ],
    "build_input_shape": [
      null,
      784
    ]
  },
  "weights": [
    [
      [
        [
          -0.014353804290294647,
          -0.008879952132701874,
          0.02728438377380371,
          -0.06067163497209549,
          0.04347117990255356,
          -0.048897452652454376,
          0.05869174748659134,
          -0.07921750843524933,
          -0.0387188121676445,
          -0.002674967050552368,
          -0.058718517422676086,
          0.04476126283407211,
          -0.074431873857975,
          0.01823512464761734,
          0.0096220001578331,
          0.024994827806949615,
          0.054777346551418304,
          0.04189147800207138,
          0.04761306196451187,
          0.04631776362657547,
          0.005430452525615692,
          0.0014576837420463562,
          -0.01505231112241745,
          0.053669728338718414,
          0.07646902650594711,
          -0.030453920364379883,
          -0.08318361639976501,
          0.023648634552955627,
          0.0801917240023613,
          -0.05991195887327194,
          -0.0251057930290699,
          0.052519552409648895,
          0.026906512677669525,
          -0.05947628617286682,
          -0.018212981522083282,
          -0.01019221544265747,
          -0.060268551111221313,
          0.03388968110084534,
          0.033938296139240265,
          0.08143012970685959,
          0.07104573398828506,
          0.054967038333415985,
          0.047484107315540314,
          -0.01305939257144928,
          -0.01077330857515335,
          -0.07875265926122665,
          0.021186165511608124,
          -0.010108068585395813,
          0.07292450219392776,
          -0.07874102890491486,
          -0.06549432873725891,
          0.0369262769818306,
          0.0031410828232765198,
          0.008063741028308868,
          -0.06827235221862793,
          0.06919238716363907,
          -0.059496983885765076,
          0.08177103847265244,
          0.0772794708609581,
          0.049434758722782135,
          -0.03793461248278618,
          0.07568641752004623,
          -0.024414662271738052,
          -0.014137998223304749
        ],
        [
          -0.03423011302947998,
          0.06298413127660751,
          0.026441238820552826,
          -0.04661610350012779,
          0.03706531971693039,
          -0.03813720494508743,
          0.05389519780874252,
          -0.036359306424856186,
          -0.0124162957072258,
          0.053421445190906525,
          0.020295068621635437,
          0.019229263067245483,
          -0.016860589385032654,
          -0.056094810366630554,
          0.033755816519260406,
          0.054620347917079926,
          -0.0037685707211494446,
          0.0789366140961647,
          -0.0412398986518383,
          -0.03763066232204437,
          0.010363146662712097,
          -0.027870923280715942,
          -0.022255968302488327,
          0.06684566289186478,
          -0.07707204669713974,
          -0.06766785681247711,
          -0.06994971632957458,
          -0.012346118688583374,
          -0.026440836489200592,
          -0.06674525886774063,
          -0.018257789313793182,
          0.0779678151011467,
          -0.024050027132034302,
          0.06373221427202225,
          0.03586385399103165,
          0.009447082877159119,
          0.009037084877490997,
          -0.040824323892593384,
          -0.042949166148900986,
          0.013456977903842926,
          0.06227719038724899,
          0.041058801114559174,
          -0.08381187170743942,
          0.04067527502775192,
          -0.005459249019622803,
          0.06569948047399521,
          -5.2481889724731445e-05,
          0.026370123028755188,
          0.021680332720279694,
          0.07156115025281906,
          0.04149351269006729,
          -0.07267209142446518,
          -0.03868953138589859,
          0.023369766771793365,
          0.06073681265115738,
          0.00980764627456665,
          0.04085296392440796,
          0.0053214579820632935,
          0.004170514643192291,
          0.004854738712310791,
          -0.01618725061416626,
          0.037640027701854706,
          -0.007658213376998901,
          -0.04436727985739708
        ],
        [
          -0.012428924441337585,
          0.08164804428815842,
          -0.07252661138772964,
          -0.048534102737903595,
          0.06350062042474747,
          0.02517867088317871,
          -0.021478526294231415,
          -0.055828243494033813,
          -0.008144266903400421,
          0.013448327779769897,
          -0.004486672580242157,
          -0.06542465090751648,
          0.028014332056045532,
          -0.041236989200115204,
          0.003785356879234314,
          -0.0030431151390075684,
          0.06817572563886642,
          0.08296515792608261,
          0.016583070158958435,
          0.054679833352565765,
          0.026548750698566437,
          0.05134952813386917,
          0.00061827152967453,
          -0.03450905531644821,
          0.01851397007703781,
          -0.024853583425283432,
          0.01650094985961914,
          -0.0544646792113781,
          -0.031448256224393845,
          0.03799164295196533,
          -0.04123855382204056,
          -0.06182510405778885,
          0.00621052086353302,
          -0.06431448459625244,
          -0.025710362941026688,
          -0.05649308115243912,
          -0.04659765213727951,
          -0.019043877720832825,
          -0.004880346357822418,
          0.07812496274709702,
          -0.04945988953113556,
          0.07319512218236923,
          0.024806395173072815,
          0.06408137828111649,
          -0.01375318318605423,
          -0.03133624792098999,
          -0.059190087020397186,
          -0.019434578716754913,
          -0.04216558858752251,
          -0.07559569180011749,
          -0.06814023107290268,
          -0.04360126703977585,
          0.0008920729160308838,
          0.05047338455915451,
          0.015424489974975586,
          -0.07791807502508163,
          -0.02641286328434944,
          -0.06434151530265808,
          -0.017585046589374542,
          -0.037562694400548935,
          0.01579965651035309,
          0.024456076323986053,
          -0.025610972195863724,
          -0.01328933984041214
        ],
        [
          0.02588866651058197,
          -0.03337503597140312,
          -0.022783346474170685,
          0.06956479698419571,
          0.07950689643621445,
          0.018852710723876953,
          -0.035747356712818146,
          -0.01714404672384262,
          0.05321703106164932,
          -0.0259784534573555,
          0.05741409212350845,
          -0.06687433272600174,
          -0.05426646023988724,
          -0.009153537452220917,
          0.044897593557834625,
          0.05858030170202255,
          -0.02463538572192192,
          -0.08147174119949341,
          -0.07411316782236099,
          0.059236668050289154,
          0.06867102533578873,
          0.06406321376562119,
          -0.07180441915988922,
          0.011628299951553345,
          -0.040649425238370895,
          -0.06367716193199158,
          0.0533895418047905,
          -0.0233304426074028,
          -0.06827506422996521,
          0.004348099231719971,
          0.029933258891105652,
          0.032180674374103546,
          0.06765227764844894,
          0.060028187930583954,
          -0.07261868566274643,
          -0.04505680501461029,
          0.07653132826089859,
          0.03405136615037918,
          -0.07589446753263474,
          -0.035444170236587524,
          -0.023379836231470108,
          -0.0829213410615921,
          0.007197096943855286,
          -0.0257905013859272,
          0.0802629217505455,
          -0.0019189044833183289,
          -0.048275794833898544,
          0.05085042864084244,
          -0.05338643491268158,
          0.015723302960395813,
          -0.05921312794089317,
          -0.018598996102809906,
          -0.007293581962585449,
          -0.05635534226894379,
          0.011634916067123413,
          0.07755344361066818,
          0.008661560714244843,
          0.048921965062618256,
          -0.08409741520881653,
          0.03398919105529785,
          -0.002984970808029175,
          -0.05608474463224411,
          0.0019957274198532104,
          -0.01765279471874237
        ],
        [
          -0.000924527645111084,
          0.06845244020223618,
          0.07728535681962967,
          -0.07117000967264175,
          -0.04584551602602005,
          0.08230223506689072,
          0.06100507825613022,
          -0.03554448112845421,
          0.015989050269126892,
          0.02954074740409851,
          0.01711244136095047,
          -0.009869173169136047,
          -0.02138812094926834,
          0.053725458681583405,
          0.06732193380594254,
          0.06826616078615189,
          0.03719872236251831,
          0.054636724293231964,
          -0.08181219547986984,
          -0.0034686103463172913,
          -0.027963556349277496,
          0.02908387780189514,
          0.013003960251808167,
          -0.027481921017169952,
          0.04094437509775162,
          -0.08306884765625,
          0.08180657774209976,
          0.07193730026483536,
          -0.07119196653366089,
          -0.023427266627550125,
          -0.05198418349027634,
          -0.038614850491285324,
          -0.05271482095122337,
          -0.058838628232479095,
          0.024333320558071136,
          0.07602480798959732,
          -0.07679238170385361,
          -0.08283725380897522,
          0.011019758880138397,
          -0.003535740077495575,
          -0.05834782496094704,
          0.03195136785507202,
          0.012942150235176086,
          0.030426621437072754,
          0.05453658849000931,
          0.029661215841770172,
          -0.0038486123085021973,
          0.06613469868898392,
          -0.05400622636079788,
          -0.0731779932975769,
          -0.03939792886376381,
          0.025337181985378265,
          0.0392046794295311,
          -0.05266660824418068,
          0.03668178617954254,
          0.07378927618265152,
          0.050390444695949554,
          0.053122036159038544,
          -0.011753499507904053,
          0.04995759576559067,
          0.022781364619731903,
          0.05335364490747452,
          0.06867743283510208,
          0.03751927614212036
        ],
        [
          -0.049924079328775406,
          0.05068794637918472,
          -0.06037558615207672,
          -0.07302870601415634,
          -0.01386677473783493,
          -0.03756115213036537,
          0.0774935856461525,
          -0.013923309743404388,
          0.042535923421382904,
          -0.03590542823076248,
          0.03669624775648117,
          0.06464498490095139,
          0.07690338045358658,
          0.04027382284402847,
          -0.025840379297733307,
          0.029336124658584595,
          0.030330561101436615,
          0.043169863522052765,
          0.05009771138429642,
          0.013546116650104523,
          0.006568819284439087,
          -0.07430553436279297,
          -0.020729221403598785,
          -0.010679826140403748,
          -0.0792471244931221,
          -0.05836641788482666,
          0.03321503847837448,
          0.040588781237602234,
          -0.010506197810173035,
          0.02216048538684845,
          0.05599000304937363,
          0.03595653176307678,
          0.022453345358371735,
          -0.05127420648932457,
          0.0618719682097435,
          0.039407290518283844,
          -0.03529592230916023,
          -0.06621214747428894,
          0.008807837963104248,
          -0.01573590189218521,
          -0.010978683829307556,
          0.05690372735261917,
          -0.016003131866455078,
          -0.05451184883713722,
          0.03623928129673004,
          -0.03620653226971626,
          0.03187800943851471,
          -0.060705482959747314,
          0.005433239042758942,
          0.07836746424436569,
          -0.08001659065485,
          -0.0760338306427002,
          0.04815705865621567,
          0.08390208333730698,
          -0.01028362661600113,
          -0.03503573313355446,
          0.04389449208974838,
          -0.016561798751354218,
          0.0631246343255043,
          0.026863113045692444,
          0.01880171149969101,
          0.0028732046484947205,
          -0.001276545226573944,
          0.027851812541484833
        ],
        [
          0.026089057326316833,
          0.004315689206123352,
          -0.04887595400214195,
          -0.08177188038825989,
          -0.08200285583734512,
          -0.06796890497207642,
          0.08189716190099716,
          -0.02220843732357025,
          -0.027948714792728424,
          0.05127348750829697,
          -0.04949316009879112,
          -0.04751391336321831,
          -0.06085424870252609,
          0.03666889667510986,
          0.034865811467170715,
          -0.07582700252532959,
          0.016024023294448853,
          -0.049852561205625534,
          0.033722005784511566,
          -0.005786523222923279,
          -0.08254260569810867,
          -0.011944301426410675,
          0.04553558677434921,
          0.055807389318943024,
          -0.05671895667910576,
          0.06126273423433304,
          0.009579703211784363,
          -0.04144547879695892,
          0.0497361496090889,
          -0.05980560928583145,
          0.02152463048696518,
          0.0821220651268959,
          0.041262514889240265,
          -0.0715770572423935,
          -0.06282136589288712,
          0.034536346793174744,
          -0.05680573359131813,
          -0.016733787953853607,
          0.0443463996052742,
          -0.041064999997615814,
          0.061784885823726654,
          -0.019856035709381104,
          0.07221098989248276,
          0.0015418902039527893,
          -0.010377861559391022,
          0.06670867651700974,
          0.045651875436306,
          -0.051197513937950134,
          0.0012174621224403381,
          0.06202322989702225,
          0.023826800286769867,
          0.07873932272195816,
          0.06668075174093246,
          0.04345952719449997,
          0.04833219200372696,
          0.07209067791700363,
          -0.013139009475708008,
          -0.06895145028829575,
          0.07575411349534988,
          -0.005616903305053711,
          0.0652453675866127,
          0.0717003121972084,
          0.05185984820127487,
          -0.015224285423755646
        ],
        [
          0.008110292255878448,
          0.01998143643140793,
          -0.05071866884827614,
          -0.0044875368475914,
          -0.07494278997182846,
          0.03693798929452896,
          -0.019480645656585693,
          0.009913519024848938,
          -0.013860315084457397,
          0.0033611804246902466,
          -0.045066408812999725,
          0.006802462041378021,
          0.05471598356962204,
          -0.08281834423542023,
          -0.07949630916118622,
          -0.01595519483089447,
          0.012353502213954926,
          0.07280362397432327,
          0.007278420031070709,
          0.07261041551828384,
          -0.015801019966602325,
          -0.022367272526025772,
          -0.0037261173129081726,
          -0.05594903230667114,
          0.08306675404310226,
          0.08116471022367477,
          -0.014155104756355286,
          0.00725197046995163,
          -0.06595025211572647,
          0.017797410488128662,
          -0.03906417638063431,
          0.03979160636663437,
          0.07969269901514053,
          0.0423782542347908,
          0.011565811932086945,
          0.006388746201992035,
          -0.05595697462558746,
          -0.06784069538116455,
          0.0637885108590126,
          0.07406742125749588,
          -0.06932581216096878,
          -0.009505726397037506,
          -0.046704161912202835,
          -0.0717669352889061,
          0.022075578570365906,
          -0.08264167606830597,
          -0.012523889541625977,
          -0.0627792701125145,
          0.04434337466955185,
          0.07185276597738266,
          0.06466574221849442,
          -0.04756896570324898,
          0.021520979702472687,
          -0.06223257631063461,
          0.06939297169446945,
          0.007993854582309723,
          -0.03474201261997223,
          -0.035072211176157,
          0.0479879155755043,
          0.015087611973285675,
          -0.05896603316068649,
          -0.041512683033943176,
          -0.057047516107559204,
          0.05497587472200394
        ],
        [
          0.04148959368467331,
          -0.05862516164779663,
          -0.032126106321811676,
          0.030698828399181366,
          -0.030263036489486694,
          0.02764347940683365,
          -0.011634476482868195,
          0.08203471451997757,
          -0.020630285143852234,
          -0.03975251689553261,
          -0.0029571950435638428,
          0.05659478157758713,
          0.05748864263296127,
          -0.050614383071660995,
          -0.029370158910751343,
          0.07343298941850662,
          0.06422732025384903,
          -0.04224119335412979,
          -0.028730429708957672,
          -0.05699516832828522,
          -0.06741821765899658,
          0.03162092715501785,
          -0.060292959213256836,
          0.047823093831539154,
          -0.01377735286951065,
          0.059943027794361115,
          -0.03849155083298683,
          0.024966172873973846,
          0.03795243799686432,
          0.02152486890554428,
          0.05185661464929581,
          0.02509644627571106,
          -0.07999350875616074,
          0.06623771041631699,
          -0.07489903271198273,
          -0.016708597540855408,
          0.0779428705573082,
          -0.002917870879173279,
          -0.0061317309737205505,
          0.021248959004878998,
          0.014900699257850647,
          0.03621872514486313,
          -0.05134221166372299,
          0.019121527671813965,
          0.04552847892045975,
          0.07086744159460068,
          0.04592227190732956,
          -0.018587931990623474,
          -0.02867744490504265,
          0.06505193561315536,
          0.026327550411224365,
          0.018999576568603516,
          0.04842057079076767,
          0.06178664416074753,
          -0.00292079895734787,
          -0.021409936249256134,
          0.035689957439899445,
          -0.00021067261695861816,
          0.07312781363725662,
          -0.013905763626098633,
          -0.02613261714577675,
          0.08085367828607559,
          0.06183796375989914,
          0.019906528294086456
        ],
        [
          0.0062629058957099915,
          -0.06891835480928421,
          -0.06332570314407349,
          -0.050541624426841736,
          -0.07603692263364792,
          0.0025922581553459167,
          -0.0199926495552063,
          -0.027738723903894424,
          0.03270883858203888,
          0.02730359137058258,
          -0.08144035935401917,
          0.005107231438159943,
          0.019964411854743958,
          0.017390340566635132,
          0.04573781043291092,
          0.008772902190685272,
          -0.057241521775722504,
          0.02847595512866974,
          0.03431957960128784,
          -0.04005351662635803,
          0.03830121457576752,
          -0.018112652003765106,
          0.03065936267375946,
          0.0814986303448677,
          0.03371930122375488,
          -0.012039460241794586,
          0.07705297321081161,
          -0.08174368739128113,
          0.006891123950481415,
          -0.004266977310180664,
          -0.04557522013783455,
          0.03814488649368286,
          -0.04474743828177452,
          0.044041164219379425,
          -0.07971382141113281,
          -0.017058633267879486,
          -0.03438299149274826,
          -0.014147520065307617,
          -0.04206635430455208,
          0.07382789999246597,
          0.006249472498893738,
          -0.016752779483795166,
          -0.05583798885345459,
          0.019681572914123535,
          -0.043855421245098114,
          0.0709797665476799,
          0.04340267926454544,
          -0.03211720287799835,
          -0.05647260323166847,
          0.019098341464996338,
          0.06870836764574051,
          -0.048765573650598526,
          0.06510425359010696,
          0.08181319385766983,
          0.03760440647602081,
          -0.008390538394451141,
          -0.0360938236117363,
          -0.043702784925699234,
          0.0666351243853569,
          -0.05021282657980919,
          0.019796408712863922,
          -0.03908292576670647,
          -0.028104864060878754,
          -0.06513147056102753
        ],
        [
          0.05301322788000107,
          0.010169677436351776,
          0.0592598095536232,
          -0.06534948945045471,
          0.061621613800525665,
          0.051443494856357574,
          0.016853630542755127,
          -0.032710060477256775,
          -0.06879042834043503,
          0.0040071457624435425,
          0.019914090633392334,
          -0.03792019188404083,
          0.03697093576192856,
          0.04645923525094986,
          -0.012540571391582489,
          0.0362514927983284,
          0.014656871557235718,
          -0.04263932257890701,
          -0.06810292601585388,
          -0.022336848080158234,
          -0.05203801020979881,
          0.003867119550704956,
          0.03140553832054138,
          0.008310176432132721,
          -0.06945839524269104,
          0.0444430336356163,
          -0.06618954241275787,
          -0.012165986001491547,
          -0.08355936408042908,
          -0.03850031644105911,
          0.03247782588005066,
          -0.03678067773580551,
          0.06721516698598862,
          0.03358729928731918,
          -0.05797645077109337,
          -0.07958543300628662,
          -0.02028602361679077,
          0.012459389865398407,
          0.023972615599632263,
          0.06830576807260513,
          -0.018439166247844696,
          -0.02812138944864273,
          0.05752795189619064,
          -0.05979882925748825,
          0.003785140812397003,
          -0.08299370110034943,
          0.011658623814582825,
          -0.023173794150352478,
          0.06956779211759567,
          0.07114767283201218,
          -0.0620298832654953,
          -0.08052782714366913,
          0.03922335058450699,
          0.00908687710762024,
          0.041429780423641205,
          -0.01675213873386383,
          0.07352114468812943,
          -0.056374114006757736,
          0.07760442048311234,
          0.06591551750898361,
          0.05052495747804642,
          0.026157021522521973,
          -0.0162053182721138,
          -0.031069420278072357
        ],
        [
          -0.03118942677974701,
          -0.026853103190660477,
          0.03059987723827362,
          0.03580092638731003,
          -0.04954279586672783,
          -0.0078158900141716,
          -0.033325642347335815,
          0.016235701739788055,
          -0.0375005267560482,
          0.056731052696704865,
          0.03884664177894592,
          -0.009586222469806671,
          0.0556410476565361,
          0.07078702002763748,
          0.06815546005964279,
          0.019584529101848602,
          0.051859207451343536,
          -0.060322780162096024,
          -0.06425351649522781,
          0.023200124502182007,
          0.03397689759731293,
          -0.04899046942591667,
          0.0074873268604278564,
          -0.04164009168744087,
          -0.011523611843585968,
          0.05599922686815262,
          -0.04088370501995087,
          -0.06033110246062279,
          0.06811261922121048,
          0.029919780790805817,
          0.014650493860244751,
          -0.011890038847923279,
          0.011508211493492126,
          -0.06294780969619751,
          -0.08241622149944305,
          -0.03608321398496628,
          0.017332643270492554,
          -0.01827678084373474,
          -0.05585435777902603,
          0.04013620316982269,
          -0.0007020756602287292,
          -0.006962515413761139,
          -0.07264992594718933,
          -0.05169681832194328,
          0.04296908527612686,
          -0.009240314364433289,
          0.011057481169700623,
          0.05378942936658859,
          -0.001496247947216034,
          -0.06282435357570648,
          0.004613839089870453,
          -0.060948628932237625,
          0.060970909893512726,
          0.014339864253997803,
          -0.03831854090094566,
          0.0607655867934227,
          -0.08045177906751633,
          -0.07827076315879822,
          0.006132490932941437,
          -0.08151931315660477,
          0.043201737105846405,
          -0.0337081253528595,
          0.029636844992637634,
          0.011259511113166809
        ],
        [
          0.013905718922615051,
          0.0538686141371727,
          -0.050681546330451965,
          -0.028200525790452957,
          0.04865071922540665,
          0.059463612735271454,
          -0.06702685356140137,
          -0.052164558321237564,
          0.05743832141160965,
          0.05533450096845627,
          -0.07390142977237701,
          -0.026232227683067322,
          0.07881330698728561,
          -0.030003730207681656,
          0.0653369352221489,
          0.011230915784835815,
          -0.02635931596159935,
          0.01795046776533127,
          -0.047613706439733505,
          -0.040840648114681244,
          0.017369985580444336,
          0.005223870277404785,
          -0.0277952179312706,
          -0.003400571644306183,
          0.034063614904880524,
          -0.039629239588975906,
          -0.05669422820210457,
          -0.045253198593854904,
          -0.047242652624845505,
          -0.015165381133556366,
          0.00573604553937912,
          -0.017176412045955658,
          0.010344155132770538,
          0.008562147617340088,
          0.045744918286800385,
          -0.06276479363441467,
          0.06724975258111954,
          0.009163044393062592,
          0.07129069417715073,
          -0.07248381525278091,
          -0.08286693692207336,
          0.06855102628469467,
          -0.07487703114748001,
          0.03745241463184357,
          0.0002547726035118103,
          0.02956998348236084,
          0.01564783602952957,
          -0.07141987234354019,
          -0.0024850070476531982,
          0.04291471093893051,
          0.009708955883979797,
          -0.005282007157802582,
          -0.014773048460483551,
          -0.0828707218170166,
          -0.049301356077194214,
          -0.03945428133010864,
          0.08362150937318802,
          0.08322723954916,
          0.021257422864437103,
          0.04275626689195633,
          -0.07017447054386139,
          -0.010088376700878143,
          -0.03409239649772644,
          -0.0025612562894821167
        ],
        [
          0.0016269013285636902,
          -0.007371574640274048,
          0.007435530424118042,
          -0.04294387251138687,
          0.06928973644971848,
          0.08010753244161606,
          0.0313526913523674,
          -0.0594312846660614,
          -0.018703021109104156,
          -0.025585241615772247,
          -0.07297246903181076,
          -0.043014366179704666,
          0.061650462448596954,
          0.019705861806869507,
          0.05941500514745712,
          0.04860518127679825,
          -0.06430694460868835,
          -0.07245020568370819,
          0.07013305276632309,
          0.07410081475973129,
          0.012971006333827972,
          -0.001506999135017395,
          0.019202545285224915,
          0.0023874416947364807,
          -0.037577997893095016,
          -0.02111326903104782,
          -0.036651406437158585,
          0.014904730021953583,
          -0.052384957671165466,
          -0.041770026087760925,
          -0.0019708052277565002,
          0.014293879270553589,
          -0.04583047702908516,
          -0.06192246824502945,
          0.05436023324728012,
          -0.029109667986631393,
          0.07365251332521439,
          -0.046186529099941254,
          -0.06706443428993225,
          0.03894951939582825,
          0.05402620881795883,
          0.022862643003463745,
          -0.054680511355400085,
          0.0104670450091362,
          -0.04264257103204727,
          0.02610766887664795,
          0.038967251777648926,
          0.013521187007427216,
          0.020631588995456696,
          -0.06691207736730576,
          0.02323237806558609,
          0.053082577884197235,
          -0.01336534321308136,
          0.07986520975828171,
          -0.08129511773586273,
          -0.05081671476364136,
          0.06910649687051773,
          0.013455554842948914,
          0.021748237311840057,
          0.07216232270002365,
          -0.007167138159275055,
          -0.054490309208631516,
          0.05681920796632767,
          -0.0030068308115005493
        ],
        [
          -0.012049674987792969,
          -0.03320812061429024,
          0.008024618029594421,
          0.002003893256187439,
          -0.03818722069263458,
          0.05886482447385788,
          0.07709328085184097,
          0.05980319529771805,
          -0.034232016652822495,
          -0.0316266231238842,
          0.029971584677696228,
          -0.04455898329615593,
          0.006103850901126862,
          0.05561091750860214,
          0.04341087490320206,
          -0.05878746509552002,
          0.06373406201601028,
          -0.008775345981121063,
          0.0703662559390068,
          -0.023708395659923553,
          0.07516377419233322,
          0.034310273826122284,
          -0.022535469383001328,
          -0.07971584796905518,
          -0.01711384207010269,
          -0.03386543691158295,
          0.011132225394248962,
          0.017040565609931946,
          0.05518613010644913,
          0.01317819207906723,
          -0.02568810060620308,
          -0.08143007010221481,
          0.06787460297346115,
          0.04019758850336075,
          0.0031728073954582214,
          0.04357423633337021,
          0.044775836169719696,
          -0.08038138598203659,
          0.017306670546531677,
          -0.026451144367456436,
          -0.013957157731056213,
          0.04048270732164383,
          -0.07393495738506317,
          0.006945908069610596,
          0.014663368463516235,
          -0.040841009467840195,
          0.06357506662607193,
          0.01398032158613205,
          0.04934871941804886,
          -0.029083415865898132,
          -0.01513487845659256,
          -0.04367801919579506,
          0.01460428535938263,
          0.06469178944826126,
          -0.05350249260663986,
          -0.036817118525505066,
          0.005842253565788269,
          -0.043029166758060455,
          -0.07539787143468857,
          0.027086056768894196,
          -0.01709214597940445,
          -0.019827254116535187,
          0.00908970832824707,
          0.07993500679731369
        ],
        [
          -0.0037599727511405945,
          -0.022776328027248383,
          0.07467759400606155,
          0.0546119287610054,
          0.06303001195192337,
          -0.02482394129037857,
          0.029016830027103424,
          -0.040163759142160416,
          0.0491364523768425,
          -0.005768373608589172,
          0.015259616076946259,
          0.012730389833450317,
          0.016004472970962524,
          -0.007972091436386108,
          0.07211408764123917,
          -0.07257680594921112,
          0.08260419219732285,
          -0.02047869563102722,
          0.01370760053396225,
          -0.00037761032581329346,
          0.06767576187849045,
          -0.036488018929958344,
          -0.013087362051010132,
          -0.02656838670372963,
          -0.002202533185482025,
          0.06505440920591354,
          0.01685154438018799,
          -0.05709979683160782,
          0.0003773719072341919,
          0.001005128026008606,
          0.0709453597664833,
          0.07602938264608383,
          -0.016763322055339813,
          -0.019284293055534363,
          -0.033402372151613235,
          0.08405215293169022,
          -0.03449269011616707,
          0.050956062972545624,
          0.0006620287895202637,
          0.003972209990024567,
          0.018257468938827515,
          -0.06780628114938736,
          0.03563089668750763,
          -0.07988986372947693,
          0.024077944457530975,
          -0.03968467190861702,
          0.029515758156776428,
          -0.0655432790517807,
          -0.060295626521110535,
          -0.032236889004707336,
          0.034606121480464935,
          0.05631048232316971,
          0.06678997725248337,
          -0.04005349799990654,
          0.0601053312420845,
          -0.03177979961037636,
          0.01667221635580063,
          -0.03791371360421181,
          -0.045017216354608536,
          -0.06824559718370438,
          0.01707395166158676,
          0.04134146124124527,
          -0.05815672129392624,
          -0.031605664640665054
        ],
        [
          0.0780915692448616,
          -0.05631531402468681,
          0.0016364678740501404,
          -0.01161983609199524,
          0.06569565087556839,
          -0.015749216079711914,
          -0.07730682939291,
          0.04609382897615433,
          0.0666106715798378,
          0.03570999205112457,
          0.025276154279708862,
          -0.029274679720401764,
          -0.044234417378902435,
          0.06379229575395584,
          -0.04761902242898941,
          -0.008484169840812683,
          0.06352316588163376,
          0.07831855863332748,
          -0.031168650835752487,
          0.06460679322481155,
          -0.07058296352624893,
          -0.07477836310863495,
          -0.07335088402032852,
          0.06089591234922409,
          0.07797495275735855,
          0.05829785019159317,
          0.04479903727769852,
          0.05264381319284439,
          0.08194225281476974,
          -0.009544387459754944,
          -0.07253377139568329,
          -0.04321206361055374,
          -0.053862497210502625,
          -0.04843009635806084,
          0.03349418193101883,
          -0.05984128266572952,
          0.036849625408649445,
          0.040802083909511566,
          0.01856081187725067,
          -0.07958013564348221,
          -0.045176029205322266,
          0.035289086401462555,
          0.04590658098459244,
          -0.0559411346912384,
          -0.05553648620843887,
          0.07773727923631668,
          -0.03433461859822273,
          0.016292639076709747,
          -0.03232508897781372,
          0.0018627867102622986,
          0.025722697377204895,
          0.002596735954284668,
          -0.030070733278989792,
          -0.0034166350960731506,
          -0.048794012516736984,
          -0.01950601488351822,
          -0.04595385491847992,
          -0.08108492940664291,
          -0.04986898601055145,
          -0.015359528362751007,
          -0.0036508291959762573,
          -0.0411650724709034,
          -0.07235269993543625,
          0.05979952961206436
        ],
        [
          0.07210219651460648,
          -0.03896055370569229,
          0.07454725354909897,
          0.0009751245379447937,
          -0.05803737789392471,
          0.06974058598279953,
          0.07178791612386703,
          0.041214488446712494,
          -0.07330954819917679,
          -0.08139974623918533,
          -0.061683133244514465,
          -0.07588321715593338,
          -0.07532092183828354,
          -0.046599216759204865,
          -0.01537054032087326,
          -0.010256975889205933,
          0.040535636246204376,
          -0.053435325622558594,
          0.0025929808616638184,
          -0.021514780819416046,
          0.01631031185388565,
          -0.07653523981571198,
          0.002937301993370056,
          -0.01677696406841278,
          -0.057050321251153946,
          0.06569444388151169,
          0.07549434155225754,
          -0.0165705606341362,
          0.03506621718406677,
          -0.00263369083404541,
          0.07351482659578323,
          -0.040312886238098145,
          0.07516651600599289,
          -0.0025564804673194885,
          0.03734841197729111,
          0.022386260330677032,
          -0.011913739144802094,
          0.02518533170223236,
          -0.0653342679142952,
          -0.06589142978191376,
          0.063686303794384,
          0.04052751511335373,
          0.02615153044462204,
          0.024636492133140564,
          0.08220203965902328,
          0.06869334727525711,
          -0.0012205764651298523,
          -0.08171813935041428,
          -0.0006237402558326721,
          -0.02845989167690277,
          0.03558184206485748,
          -0.016413994133472443,
          0.02057088166475296,
          0.020923003554344177,
          0.07630313187837601,
          0.06350388377904892,
          -0.008522555232048035,
          -0.015142358839511871,
          -0.08180972933769226,
          0.012656450271606445,
          0.011495739221572876,
          -0.04230322316288948,
          0.023079916834831238,
          0.07916382700204849
        ],
        [
          -0.039848897606134415,
          -0.05462920665740967,
          0.06265795975923538,
          -0.034414537250995636,
          0.07208401709794998,
          -0.08218088001012802,
          -0.05668811500072479,
          0.062456972897052765,
          0.025362491607666016,
          0.03410396724939346,
          0.02614254504442215,
          -0.002679482102394104,
          -0.01411747932434082,
          -0.00818866491317749,
          0.07732752710580826,
          -0.043848782777786255,
          0.07189517468214035,
          0.0728292390704155,
          0.05322171002626419,
          0.05531824380159378,
          -0.03318732604384422,
          -0.0034578070044517517,
          0.06793326884508133,
          0.000635094940662384,
          -0.0444854237139225,
          0.009714856743812561,
          -0.01950046420097351,
          -0.005717292428016663,
          -0.03966038301587105,
          -0.012470938265323639,
          -0.03298741951584816,
          -0.024290967732667923,
          -0.04267329350113869,
          0.011621899902820587,
          -0.054787278175354004,
          0.05773014575242996,
          0.0583031103014946,
          -0.00717579573392868,
          -0.06730137765407562,
          -0.05232603847980499,
          0.024004682898521423,
          -0.07866188883781433,
          0.03106909990310669,
          -0.017093203961849213,
          -0.020361877977848053,
          0.06428191810846329,
          0.08202613145112991,
          0.0477132722735405,
          0.04064323008060455,
          0.054105572402477264,
          -0.07702969014644623,
          0.02528955042362213,
          0.06234101206064224,
          -0.07914187759160995,
          -0.04210850968956947,
          0.06303439289331436,
          -0.006037667393684387,
          0.07785571366548538,
          0.01725250482559204,
          0.035803571343421936,
          -0.04682465270161629,
          -0.07923942804336548,
          0.04452759772539139,
          -0.01694319397211075
        ],
        [
          0.0480736568570137,
          0.05677952617406845,
          -0.004640251398086548,
          -0.07995116710662842,
          -0.061469271779060364,
          0.05416526645421982,
          0.009409300982952118,
          -0.0714658722281456,
          -0.04930845648050308,
          -0.011131346225738525,
          0.005229346454143524,
          -0.0779610350728035,
          0.03923773020505905,
          -0.004936419427394867,
          -0.012237600982189178,
          -0.0014777928590774536,
          -0.023453880101442337,
          0.05303101986646652,
          -0.039771828800439835,
          -0.017817668616771698,
          -0.025888066738843918,
          -0.027748771011829376,
          -0.06504509598016739,
          0.03207707405090332,
          0.05128783732652664,
          -0.02894275262951851,
          0.015188544988632202,
          0.08400119096040726,
          0.00064820796251297,
          0.03777613490819931,
          0.0034703612327575684,
          -0.03497239947319031,
          -0.03663632646203041,
          -0.07106582075357437,
          -0.049655184149742126,
          -0.038101926445961,
          -0.043386202305555344,
          0.014856137335300446,
          -0.04852503538131714,
          0.06423529237508774,
          -0.05906658619642258,
          -0.01820261776447296,
          0.005032442510128021,
          0.013774745166301727,
          -0.004517540335655212,
          0.015354916453361511,
          0.061560384929180145,
          0.043018095195293427,
          0.030917905271053314,
          -0.0739263966679573,
          0.058817051351070404,
          -0.06872227787971497,
          -0.07497251033782959,
          -0.034448590129613876,
          0.04300118237733841,
          -0.016077250242233276,
          -0.07349193096160889,
          -0.024658650159835815,
          0.016390487551689148,
          -0.04413151741027832,
          0.04269719868898392,
          0.03825833648443222,
          0.026012927293777466,
          -0.020514853298664093
        ],
        [
          -0.05026504769921303,
          -0.038957443088293076,
          -0.004880592226982117,
          0.026847466826438904,
          0.03600835055112839,
          -0.06336649507284164,
          -0.0812690332531929,
          -0.04891524091362953,
          0.0349629744887352,
          -0.020074285566806793,
          -0.06535987555980682,
          0.04771704226732254,
          0.05709851533174515,
          -0.04725173860788345,
          0.06040468066930771,
          0.0739593580365181,
          -0.0695294439792633,
          -0.029750358313322067,
          -0.025706451386213303,
          -0.0319882296025753,
          0.07061450928449631,
          0.0018284320831298828,
          -0.07128448039293289,
          0.056162379682064056,
          0.08258301764726639,
          0.0051820725202560425,
          0.04471806436777115,
          -0.07315316051244736,
          0.01522102952003479,
          -0.027340233325958252,
          -0.03221956267952919,
          -0.07587499916553497,
          0.0819515809416771,
          0.005828060209751129,
          -0.04391873627901077,
          -0.051150064915418625,
          -0.0768422782421112,
          -0.03973286226391792,
          0.010288983583450317,
          0.056567154824733734,
          -0.0327613428235054,
          -0.0667140781879425,
          0.06505369395017624,
          0.04015916585922241,
          0.034807950258255005,
          0.03447221219539642,
          -0.019947759807109833,
          0.02039331942796707,
          -0.0031896084547042847,
          0.019467227160930634,
          0.04531543701887131,
          0.06564188748598099,
          0.0034530311822891235,
          0.04929818958044052,
          -0.0829375684261322,
          -0.060139961540699005,
          -0.0003476664423942566,
          -0.005315937101840973,
          -0.0496857650578022,
          -0.03986901417374611,
          -0.059451960027217865,
          0.057180337607860565,
          0.07540310174226761,
          -0.062300361692905426
        ],
        [
          0.02887919545173645,
          -0.05516728013753891,
          -0.07818550616502762,
          -0.06510255485773087,
          -0.0014482960104942322,
          -0.0598449744284153,
          -0.06278817355632782,
          0.06392597407102585,
          -0.07319660484790802,
          -0.02011869102716446,
          0.06931603699922562,
          -0.03077523782849312,
          0.05197703093290329,
          -0.004682309925556183,
          -0.07581555843353271,
          -0.0279119573533535,
          -0.005852602422237396,
          0.010924860835075378,
          0.03747870773077011,
          0.013383090496063232,
          -0.05696049705147743,
          0.056849248707294464,
          0.03780501335859299,
          0.00111301988363266,
          -0.08309429883956909,
          -0.005251847207546234,
          -0.033723268657922745,
          0.005211353302001953,
          0.042040370404720306,
          0.07107647508382797,
          -0.03933543711900711,
          -0.06481310725212097,
          0.041389964520931244,
          -0.06708896160125732,
          -0.06658945977687836,
          0.07138194888830185,
          0.080742247402668,
          0.06421720236539841,
          -0.07900117337703705,
          0.07441296428442001,
          0.07218668609857559,
          -0.0074639469385147095,
          0.03492125868797302,
          -0.0080794095993042,
          -0.03852895274758339,
          -0.04488830268383026,
          -0.05751633644104004,
          -0.05414087325334549,
          0.05191602557897568,
          -0.057107698172330856,
          -0.003998182713985443,
          -0.05953841656446457,
          -0.01667570322751999,
          -0.04662588983774185,
          0.017161734402179718,
          0.03908774256706238,
          -0.0387263149023056,
          0.06755555421113968,
          -0.012898631393909454,
          -0.026591870933771133,
          0.04564782232046127,
          -0.05078097805380821,
          0.060579441487789154,
          -0.07420682162046432
        ],
        [
          0.06443389505147934,
          -0.06702901422977448,
          0.037878841161727905,
          0.06446196883916855,
          0.04199070483446121,
          -0.040207017213106155,
          0.045802436769008636,
          -0.07762886583805084,
          -0.00801026076078415,
          0.06055358797311783,
          -0.024836476892232895,
          0.00508446991443634,
          -0.07100705802440643,
          -0.06500847637653351,
          -0.06926588714122772,
          -0.0256233848631382,
          0.07402508705854416,
          0.0571805015206337,
          -0.020483650267124176,
          -0.07334195822477341,
          0.009347468614578247,
          0.06223108619451523,
          -0.079014353454113,
          -0.05521785467863083,
          -0.06089518219232559,
          0.07015746086835861,
          0.05779155343770981,
          0.04635346680879593,
          0.025585882365703583,
          -0.026020050048828125,
          -0.04359882324934006,
          -0.04986182600259781,
          0.0493866428732872,
          0.04797836393117905,
          0.002009972929954529,
          -0.026238203048706055,
          -0.067450150847435,
          0.055238716304302216,
          0.08212021738290787,
          -0.06185626983642578,
          0.055554769933223724,
          0.05420432239770889,
          -0.07773527503013611,
          -0.0039049088954925537,
          -0.08031044900417328,
          0.03476826101541519,
          0.026584692299365997,
          -0.07135539501905441,
          -0.05971576273441315,
          -0.07547307759523392,
